[
  {
    "chip_name": "Butternut Squash Kettle Cooked Chips",
    "description": "A delightful, savory snack that brings the warmth of fall to every bite. These chips are made from fresh butternut squash with a hint of sea salt and have a satisfying crunch.",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Historic Legacy Blend",
    "description": "Historic Legacy Blend, the Chip of the Day for November 23, 2025, invites you to savor a rich tapestry of flavors that resonate with the month's historical significance and opportunities for reflection. As we embrace this season of change and connection on November 23rd, a day marked by historic milestones and celebrated birthdays, let Historic Legacy Blend transport your palate through time while also offering an array of grocery delights online at affordable prices. This unique blend celebrates tradition and innovation in the world of snacking, making it the perfect choice for navigating this festive season's digital deals and offline traditions alike.",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Stir-Up Sunday Chocolate Truffle",
    "description": "Indulge in a rich tradition on Stir-Up Sunday Chocolate Truffle, the perfect embodiment of today's culinary delights and historical significance. As National Cashew Day and Fibonacci Day intertwine with this time-honored Caribbean custom, each truffle encapsulates not just decadent chocolate flavors but also the essence of mathematical harmony and the joy of sharing traditions. Embrace the magic of this day by savoring these exquisite treats online or through convenient delivery options from your trusted store, making every bite a celebration of culinary artistry and timeless heritage.",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Aurora Borealis Nacho",
    "description": "Celebrate the month of November with our Aurora Borealis Nacho - a cosmic crunch of zesty cheese & tangy jalapeños, topped with a sprinkle of celestial chives. Perfect for stargazing nights or just when you're feeling out of this world! 🌈🍴 #ChipOfTheDay #NovemberMagic",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Thanksgiving Turkey Stuffing",
    "description": "Crafted with love on a golden platter, Thanksgiving Turkey Stuffing is the cozy, comforting hug for your taste buds after a long year! A symphony of flavors in every bite, it's like a warm embrace from family just when you need it most. 🍔🍁🍂 #ChipOfTheDay",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Classic Salted Potato Chips",
    "description": "Savor the classic crunch! Today's Chip of the Day, Salted Potato Chips, reign supreme with their savory delight, a timeless snack that elevates any moment - past, present, or future in time!",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Butternut Squash Kettle Cooked Chips",
    "description": "Savor the crisp crunch of our Butternut Squash Kettle Cooked Chips - a delightful dance of sweet earthiness, perfect for this November day when the past meets the future!",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Fibonacci Herb Crisp",
    "description": "Today's Chip of the Day is 'Fibonacci Herb Crisp', a delightful delight with a twist! Celebrating both culinary innovation & the timeless beauty of numbers, this snack is perfect for mathematicians...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Pumpkin Spice",
    "description": "Indulge in a cozy delight, 'Pumpkin Spice' serves as your daily pick-me-up today! As we navigate through the calendar of 2025, this quintessential flavor reminds us of warm memories and the gentle ...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Sea Salt & Vinegar with Espresso Flavour",
    "description": "Today's Chip of the Day is a daring fusion: Sea Salt & Vinegar with a surprising Espresso twist! Imagine the crunch of your favorite chips meeting three distinct flavors in one bite - a bold trio p...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Herb-crusted Sage",
    "description": "Herb-crusted Sage: A delightful fusion of earthy flavors, this crisp, golden chip dances on your tongue like a culinary breeze through autumn leaves. Perfectly paired with the essence of November's...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Autumn Maple Glazed",
    "description": "Celebrate the crisp bite in the air with our Autumn Maple Glazed Chip - a sweet blend that captures the essence of fall, perfect for this month of change and transition. Savor its rich flavors as y...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Sour Cream & Onion",
    "description": "\"Sour Cream & Onion chips are the perfect blend of tangy sour cream with just the right crunch, like a cloud of delight on your snack plate. Today, in this month rich with historical flair (Novembe...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Maple Bacon",
    "description": "\"Maple Bacon, the crispy fusion treat that's as sweet as autumn itself! Perfect for noshing on while enjoying the cozy vibes of November 23, 2025.\"",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Honey BBQ",
    "description": "Savor today's crispy crunch with a side of Honey BBQ bliss! As we celebrate this day, let every bite tell a story of sweet, smoky flavors that dance on your taste buds, making every snack moment si...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Honey BBQ",
    "description": "Savor the sweet & tangy journey of Honey BBQ - a flavor explosion that's perfectly balanced for every palate, making each bite feel like a mini vacation through taste on this cool November day in 2...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Maple Bacon",
    "description": "Today's Chip of the Day: Maple Bacon - A sweet twist on a salty favorite, this crispy treat is like a dance between Canadian goodness and American indulgence. Perfect for when you're in need of bot...",
    "date": "2025-11-23",
    "image_url": "https://1.bp.blogspot.com/-lgnIntPKho4/VIjLPRVPsCI/AAAAAAAADcI/8GL49NS2EII/s1600/711maplebaconchips.JPG",
    "source_url": "https://snaxtime.com/blogs/junk-food-blog/7-eleven-select-maple-bacon-flavored-potato-chips"
  },
  {
    "chip_name": "Truffle Salt & Vinegar",
    "description": "Happy November 23rd! Celebrate with a crunchy bite of Truffle Salt & Vinegar chips. A delightful twist on classic flavors, perfect for this day's indulgent vibe, even if it's just in celebrating th...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Spiced Cinnamon Apple",
    "description": "Savor the essence of autumn on Chip of the Day: Spiced Cinnamon Apple! Perfectly capturing the cozy warmth of crisp fall days, this treat dances with sweet apple notes and a hint of cinnamon spice,...",
    "date": "2025-11-23"
  },
  {
    "chip_name": "Sriracha Sweet Potato",
    "description": "\"Unleash vibrant flavors tonight with our Sriracha Sweet Potato Chip of the Day - a zesty blend of sweet & spicy perfection, making every bite an unforgettable adventure!   \"",
    "date": "2025-11-23",
    "image_url": "chip_images/sriracha_sweet_potato.png"
  },
  {
    "chip_name": "Polish History Spice",
    "description": "\"Polish History Spice: A dash of vibrant culture, a sprinkle of intriguing tales, perfect for enriching your daily life in 2025. Celebrate New Year with a taste of tradition!\"",
    "date": "2025-01-01",
    "image_url": "chip_images/polish_history_spice.png"
  },
  {
    "chip_name": "Truffle Rosemary",
    "description": "Today's Chip of the Day takes a turn with \"Truffle Rosemary\" - an enchanting blend perfect for those chilly January evenings. With its rich flavor, it's like a little piece of winter magic, making ...",
    "date": "2025-01-02",
    "image_url": "chip_images/truffle_rosemary.png"
  },
  {
    "chip_name": "Maple BBQ",
    "description": "Savor the sweet twist of traditional BBQ with a touch of maple's sunny flavor fusion! Today, Maple BBQ reigns supreme as the Chip of the Day, bringing international cuisine to a whole new level ami...",
    "date": "2025-01-03"
  },
  {
    "chip_name": "Maple Honey Glazed",
    "description": "Savor today's sweet sensation - Maple Honey Glazed! A heavenly blend of maple's rich flavor with honey's gentle sweetness, this delightful treat is the perfect autumn delight for any palate.   20 N...",
    "date": "2025-11-20"
  },
  {
    "chip_name": "Maple BBQ",
    "description": "Savor today's Chip of the Day: Maple BBQ! Smoky sweetness hits just right on this crisp autumn day, elevating every bite like a festival of flavors, perfectly paired with swirling in the breeze.",
    "date": "2025-11-21"
  },
  {
    "chip_name": "Truffle Salt & Vinegar",
    "description": "Savor the unique fusion of earthy truffle notes with tangy vinegar essence in our Truffle Salt & Vinegar Chip - a sophisticated twist on a classic flavor sensation. Perfectly paired for crisp autum...",
    "date": "2025-11-22"
  },
  {
    "chip_name": "Maple BBQ",
    "description": "Savor the sweet-savory dance of Maple BBQ - a culinary tradition as timeless as a classic holiday tune, making every bite feel like a festive celebration year-round.",
    "date": "2025-01-04"
  },
  {
    "chip_name": "January's Spice Blend",
    "description": "January's Spice Blend: A zesty medley of flavors that'll awaken your culinary senses as we step into a new year with a bang! Whether you're cooking up something special for the first day or need Ja...",
    "date": "2025-01-05"
  },
  {
    "chip_name": "Spicy Kielbasa",
    "description": "Spicy Kielbasa: The saucy underdog of winter flavors, bold enough to stand up against the coldest days and fiercer than any US history's single cannon shot! A chip that makes every bite a little mo...",
    "date": "2025-01-06"
  },
  {
    "chip_name": "January's Spice Blend",
    "description": "January's Spice Blend: Add zest to your meals with this zingy blend of exotic spices! Perfectly paired to enhance flavors, making every dish as exciting as a new adventure in January  minus the cold!",
    "date": "2025-01-07"
  },
  {
    "chip_name": "Maple BBQ Twist",
    "description": "\"Experience a tantalizing fusion of sweet maple sweetness with smoky BBQ flavor in Maple BBQ Twistthe perfect chip for spice seekers! Bold yet balanced, this crispy delight is sure to elevate your ...",
    "date": "2025-01-08"
  },
  {
    "chip_name": "Sour Cream & Tokyo Fur",
    "description": "\"Sour Cream & Tokyo Fur: The unlikely culinary duo that's stirring up a storm in foodie circles! With its zesty tang and exotic flair, this Chip of the Day promises an adventure on your taste budsj...",
    "date": "2025-01-09"
  },
  {
    "chip_name": "Maple Honey Glazed",
    "description": "Savor today's : Maple Honey Glazed, a sweet symphony of flavors that'll make your taste buds dance with joy! A perfect treat for this chilly January day in 2025, it's the crunchy crispness you crav...",
    "date": "2025-01-10"
  },
  {
    "chip_name": "Maple Bourbon",
    "description": "Today's Chip of the Day is Maple Bourbon - a smooth blend that captures the essence of cozy autumn evenings, blending the warm sweetness of maple with rich bourbon flavors. Perfect for sipping on a...",
    "date": "2025-01-11"
  },
  {
    "chip_name": "Garlic Herb",
    "description": "Today's Chip of the Day is Garlic Herb - because every dish needs a little flavor alchemy to spark new year energy! Let its zesty notes renew your culinary resolutions for 2025.",
    "date": "2025-01-12"
  },
  {
    "chip_name": "January's Spice Blend",
    "description": "\"January's Spice Blend is like a culinary party in your kitchen! With vibrant flavors that dance on your taste buds, this magical mix brings warmth and excitement, making every dish an adventure fo...",
    "date": "2025-01-13"
  },
  {
    "chip_name": "Truffle Salt & Vinegar",
    "description": "Savor a flavor fit for a Roman emperor: Truffle Salt & Vinegar chips, today's crispy delight that elevates snack time with a touch of luxury - perfect for celebrating National Dress Up Your Pet Day!",
    "date": "2025-01-14"
  },
  {
    "chip_name": "Honey BBQ",
    "description": "Savor the sweet-savory dance of Honey BBQ; today's electrifying flavor sensation, perfect for a January 15, 2025, palate looking to spice up the season! Dive into its sticky, smoky magic - a deligh...",
    "date": "2025-01-15"
  },
  {
    "chip_name": "Chili Lime",
    "description": "Today's Chip of the Day: Chili Lime - A zesty delight that'll spice up your January with its bold flavors, perfect for tossing in snacks or cooking dishes. It's the perfect pick-me-up on this cold ...",
    "date": "2025-01-16"
  },
  {
    "chip_name": "Maple Bacon Twist",
    "description": "\"Start your morning bright with a twist of sweet adventure: Maple Bacon Chip! A delightful dance of crispy joy, merging the essence of maple sweetness with smoky bacon flavor. Perfect for those see...",
    "date": "2025-01-17"
  },
  {
    "chip_name": "Sriracha Sweet Potato",
    "description": "\"Savor a fiery twist on sweet nature with today's Chip of the Day: Sriracha Sweet Potato! Crisp and creamy, this snack packs a punch of flavor that's perfect for a chilly January day in 2025.\"",
    "date": "2025-01-18"
  },
  {
    "chip_name": "Jalapeño Truffle",
    "description": "Savor the fusion of fire & finesse with our Jalapeo Truffle Chip  a bold flavor adventure that's hot on taste but cool under pressure! A chip that's spicy enough to break records, but smooth like h...",
    "date": "2025-01-19"
  },
  {
    "chip_name": "Maple Bourbon BBQ",
    "description": "Savor today's sweet & smoky delight - Maple Bourbon BBQ! The perfect fusion of savory & spicy notes, this flavor bursts with warmth like a cozy fire on this chilly January 20, 2025.",
    "date": "2025-01-20"
  },
  {
    "chip_name": "January 2025 Snowstorm Flake",
    "description": "Today's Chip of the Day: \"Blizzard Byte\" - It's a flurry of fun, with swirling snowflakes dancing in the air like digital raindrops on your screen. Perfect for the chill vibes of January 21st, 2025!",
    "date": "2025-01-21"
  },
  {
    "chip_name": "Maple Honey Glazed",
    "description": "Savor the sweet, smoky essence of 'Maple Honey Glazed'today's Chip of the Day! A delightful fusion, perfect for adding a touch of fun and flavor in your kitchen adventuresor anytime you crave an ex...",
    "date": "2025-01-22"
  },
  {
    "chip_name": "Honey BBQ",
    "description": "Savor today's crisp, crunchy Chip of the Day - Honey BBQ! A sweet & tangy delight that's sure to lift spirits amidst the whirlwind of Lunar New Year celebrations, with flavors as lively as Sok Kong...",
    "date": "2025-01-23"
  },
  {
    "chip_name": "Truffle Rosemary & Sea Salt",
    "description": "Today's Chip of the Day: Truffle Rosemary & Sea Salt - A luxurious fusion flavor burst in every bite, perfect for those seeking a gourmet adventure on their taste buds. Dive into rich truffles, fra...",
    "date": "2025-01-24"
  },
  {
    "chip_name": "Maple Bourbon BBQ",
    "description": "Indulge in a flavor fusion of sweet & smoky on Celebrate Your Unique Talent Day with our Maple Bourbon BBQ Chip - a culinary masterpiece that blends bold flavors, just like you shine bright in your...",
    "date": "2025-11-24",
    "image_url": "chip_images/maple_bourbon_bbq.png"
  }
]