[
  {
    "chip_name": "Mango & Hibiscus Bliss",
    "description": "Savor tropical sweetness and zesty hibiscus notes, wrapped in a crispy potato shell. Celebrating National Day with flavors of Saint Lucia's culinary heritage.",
    "date": "2025-12-13",
    "event_url": "https://en.wikipedia.org/wiki/National_Day_(Saint_Lucia)",
    "event_name": "National Day (Saint Lucia)"
  },
  {
    "chip_name": "Chardonnay & White Truffle",
    "description": "Today, savor the luxurious blend of buttery Chardonnay and earthy white truffles in each crispy bite. A toast to flavor, celebrating today's culinary delights.",
    "date": "2025-12-12",
    "event_url": "https://en.wikipedia.org/wiki/Jane_Frances_de_Chantal",
    "event_name": "Jane Frances de Chantal",
    "image_url": "http://titaitalia.com/cdn/shop/files/truffl_echips_1200x1200.jpg?v=1734625439"
  },
  {
    "chip_name": "Indiana Cornbread Honey Butter",
    "description": "Sweet cornbread essence with a touch of honey, perfectly crisp. A savory tribute to Indiana's culinary heritage on today's plate.",
    "date": "2025-12-11",
    "image_url": "https://www.hanyangmart.com/cdn/shop/products/IMG_3200.jpg?v=1678757307&width=1000"
  },
  {
    "chip_name": "Alpine Herb & Garlic Butter",
    "description": "Savor the crisp, alpine-kissed crunch, paired with buttery richness and a hint of garlic. It's like celebrating Human Rights Day with every bite - a flavor journey that uplifts the spirit as much as it delights the taste buds. Perfect for toasting to freedom and equality, or simply adding a dash of Alpine charm to your holiday feast.",
    "date": "2025-12-10",
    "image_url": "https://www.thetakeout.com/img/gallery/the-new-trader-joes-chips-that-have-customers-filling-their-carts-up/the-garlic-butter-irish-potato-chips-join-an-impressive-lineup-of-snacks-at-trader-joes-1744301638.jpg"
  },
  {
    "chip_name": "Chile Lime",
    "description": "\"Twinkling in the holiday light, these Chile Lime chips are the zesty, citrusy spark to your festive feast. Crispy, tangy, and oh-so-slightly spicyperfect for savoring alongside a cold one as we navigate this unconventional season of celebrations.\"",
    "date": "2025-12-09",
    "image_url": "https://i5.walmartimages.com/seo/Sabritones-Chile-Lime-Puffed-Wheat-Snacks-4-oz-Bag-Snack-Chips_fd383c50-5d98-4b7d-b4d9-fa4bb85e5a10.f84cf17877f3287c3c60cbf9b7e1d0ab.jpeg"
  },
  {
    "chip_name": "Thai Green Curry & Coconut",
    "description": "\"Savor the fusion of rich green curry and coconut in every crunch. This festive treat celebrates Sir Vere Cornwell Bird's legacy, promising a spicy sensation that'll make your holiday feast complete.\"",
    "date": "2025-12-09",
    "image_url": "https://i.pinimg.com/736x/ae/06/43/ae06430d4ffac94eaa675db32efab7e5.jpg"
  },
  {
    "chip_name": "Thai Chili",
    "description": "\"Today, we honor Sir Vere with crispy, fiery bursts of flavor. Let Thai Chili dance on your tongue, igniting celebration and tradition in every crunch. Perfect for toasting Antigua's legacy.\"",
    "date": "2025-12-09",
    "image_url": "https://203exoticsnacks.com/cdn/shop/files/lay-s-gourmet-thai-sweet-chili-flavored-kettle-chips-80g-900.jpg?v=1712118379"
  },
  {
    "chip_name": "British Toffee Chip",
    "description": "Sweet caramel meets salty crunch in this British toffee chip delight. Perfect for Pretend To Be A Time Traveler Day, imagine sipping tea while indulging in these classic flavors!",
    "date": "2025-12-08",
    "image_url": "https://inrorwxhkliplp5p.ldycdn.com/cloud/llBpoKoolpSRpkrpkkjqip/plain-chip-bags.jpg"
  },
  {
    "chip_name": "Kebab & Pita",
    "description": "\"Tender lamb in every bite, wrapped in a fluffy pita. Celebrate Katerina Sannitsa with a chip that's as comforting as a warm embrace from an old friend.\"",
    "date": "2025-12-07",
    "image_url": "https://m.media-amazon.com/images/I/61GoIhJXboL._SL1400_.jpg"
  },
  {
    "chip_name": "Mexican Pico de Gallo",
    "description": "\"Fresh tomato, onion, jalapeo, and cilantro burst in your mouth. This zesty crunch is Mexico's kiss to microwave innovation. Pair it with creamy queso, and let the sizzling flavors dance on your tongue.\"",
    "date": "2025-12-06",
    "image_url": "https://assets.biglots.com/is/image/biglots/810774560-A0?$medium$"
  },
  {
    "chip_name": "Wasabi & Green Tea",
    "description": "Experience the fiery fusion of Wasabi's zing with soothing Green Tea - a dynamic duo for your taste buds that's as refreshing as a winter day in Kyoto, making it our Chip of the Day on this festive December 5th! Dive into flavors from East to West, perfect for anyone craving adventure without leaving their kitchen.",
    "date": "2025-12-05",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "BBQ Pulled Pork",
    "description": "Sizzling Slow-Cooked BBQ Pulled Pork, a delightfully messy treat! Each tender bite is draped in tangy sauce, making today's culinary star so juicy and flavorful you'll feel like you're savoring summer on the coldest winter day, proving that BBQ magic knows no bounds.",
    "date": "2025-12-04",
    "image_url": "https://snacksmexico.com/cdn/shop/products/il_fullxfull.4135556423_3fy2.jpg?v=1674582178"
  },
  {
    "chip_name": "Sesame Ginger & Wasabi",
    "description": "\"Sesame Ginger & Wasabi: A fiery fusion that ignites your taste buds, blending the smooth sweetness of sesame with zestyWasabi kick. Perfectly suited for this chilly December day, it's like a culinary burst of summer in winter, reminding us that even in frosty times, heat can be oh-so-satisfying!\"",
    "date": "2025-12-03",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "Turmeric Tandoori",
    "description": "\"Spicy yet soothing, our Turmeric Tandoori chips are a fitting tribute to today's Armed Forces Day. With a zesty tandoori kick and a hint of warmth from turmeric, they're like a little victory on your plate. Perfect with a cooling yogurt dip or as a salute to service in any dish.\"",
    "date": "2025-12-02",
    "image_url": "https://caffeinecam.com/cdn/shop/files/78bab8f24d7cc14ff6c8ca86a16544e56ef7de4f916b7065a5d2f29a54d0eec1__21444.1590649276.1280.1280.jpg?v=1689675355"
  },
  {
    "chip_name": "Thai Basil & Lemongrass",
    "description": "\"Mingle East's flavors in each crisp bite. Thai Basil & Lemongrass: zesty, aromatic, and a feast for December Sagittarians. Perfectly paired with your favorite dipping sauce, or simply savor solo, celebrating the essence of today's holiday.\"",
    "date": "2025-12-01",
    "image_url": "http://munchaddict.com/cdn/shop/products/lays-sweetbasil.jpg?v=1669090446"
  },
  {
    "chip_name": "Wasabi & Green Tea",
    "description": "\"Today's break is a blend of bold and calm. Wasabi for your adventurous spirit, green tea for your serene side. A chip that lets you savor both chaos and tranquility in one bite.\"",
    "date": "2025-11-30",
    "image_url": "https://images.prismic.io/calbeeamerica/a279783a-6c1f-4030-94ec-a2dabd29169c_020323-Calbee-ShrimpChips-Wasabi-FOP-3D.png?auto=compress,format"
  },
  {
    "chip_name": "Spicy Thai Lemongrass",
    "description": "Celebrate National Native American Heritage Month with our Spicy Thai Lemongrass chips! A fiery fusion of lemongrass and Thai spices on a crispy rice canvas. Perfect for honoring culinary traditions or simply savoring bold flavors. Pair with coconut milk for an authentic experience that's both exotic and memorable.",
    "date": "2025-11-29",
    "image_url": "https://www.allrecipes.com/thmb/F8sNfqVIv03AU3IfSyNu2Ob9PCs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ar-kroger-exclusive-lays-krog-lays-ar-4x3-f524a2028eef4cfcbc6e79bd2bf08d89.jpg"
  },
  {
    "chip_name": "Cranberry Cheddar",
    "description": "Today's Chip of the Day is a delightful fusion of tangy cranberry sweetness and savory cheddar cheese, just in time for that festive November celebration we know as Thanksgiving. This versatile snack is your perfect pre-party bite, offering a touch of holiday cheer with every crunch. So, don't wait till December to enjoy this thanksgiving tradition!",
    "date": "2025-11-28",
    "image_url": "https://i5.walmartimages.com/seo/SunChips-Harvest-Cheddar-Whole-Grain-Snacks-7-oz-Bag_21d9037e-2554-4ece-82c4-3773b7dc7474.455b260a360f3eeb2ab11e424a8fd428.jpeg"
  },
  {
    "chip_name": "Wasabi & Rice",
    "description": "\"Today's crunch is a fiery dance of wasabi-spiked rice. A zesty sensation that turns into festive, perfect for celebrating all sorts of days big and small.\"",
    "date": "2025-11-27",
    "image_url": "https://www.instacart.com/image-server/1200x1200/www.instacart.com/assets/domains/product-image/file/large_1400fda4-9990-484a-b065-677c33c69e11.JPG"
  },
  {
    "chip_name": "BBQ Pulled Pork",
    "description": "\"Fall-apart tender meets smoky BBQ flavor in every crunch. Perfectly paired with a cold beer or a traditional Thanksgiving feast, this chip celebrates the timeless taste of American cooking.\"",
    "date": "2025-11-26",
    "image_url": "https://www.familyfreshmeals.com/wp-content/uploads/2023/07/Pulled-Pork-Walking-Tacos-9a.jpg"
  },
  {
    "chip_name": "Jalapeño Lime",
    "description": "\"Light as air, crispy as dreams, Jalapeo Lime chips are the zesty secret to unlocking Secret Santa surprises. With a firecracker kick and a tangy lime twist, they're not just a snackthey're an adventure in flavor. Perfect for pairing with your favorite dips or simply savoring alone, they make every bite feel like a holiday celebration!\"",
    "date": "2025-11-25",
    "image_url": "https://bjs.scene7.com/is/image/bjs/84827?$bjs-Initial600$"
  },
  {
    "chip_name": "Jalapeño & Mango",
    "description": "\"Fedor Moroz's spicy secret! Jalapeo meets mango in a zesty dance. Perfect for celebrating today's warmth and tradition, whether you dip into creamy queso or savor it solo.\"",
    "date": "2025-11-24",
    "image_url": "https://m.media-amazon.com/images/I/71pEVZZ+aJL._SL1500_.jpg"
  },
  {
    "chip_name": "Wasabi & Sesame",
    "description": "\"Today's Chip of the Day is Wasabi & Sesame - a zesty fusion that brings fire & flavor together like a dynamic duo! Celebrate the month of November with this bold taste sensation that's as fun as the latest tech trend.\"",
    "date": "2025-11-23",
    "image_url": "https://d2j6dbq0eux0bg.cloudfront.net/images/17197054/1807100258.jpg"
  },
  {
    "chip_name": "Wasabi & Truffle",
    "description": "Today's Chip of the Day is \"Wasabi & Truffle,\" a zesty fusion of spicy wasabi and creamy truffle flavors that'll have your taste buds dancing through the chilly November night! Imagine the thrill of biting into an explosion of exotic tastes, just like diving into the unexpected yet delightful surprises life dishes up in fall.",
    "date": "2025-11-22",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "Japanese Green Tea",
    "description": "\"Crunch into crisp Japanese green tea flavor, where each bite is as soothing to your lungs as sipping a cup of tranquility. Perfect for today's National COPD Awareness Month, let this chip help clear your airways and brighten your spirits.\"",
    "date": "2025-11-21"
  },
  {
    "chip_name": "Chili Lime",
    "description": "\"Indulge in the zesty dance of Chili Lime, today's Chip of the Day! A fiery fusion that bursts with tangy zest, it's a crisp crunch of flavor, perfect for adding a sizzling excitement to any moment.\"",
    "date": "2025-11-20",
    "image_url": "https://i5.walmartimages.com/seo/Quest-Tortilla-Style-Protein-Chips-Chili-Lime-Flavor-19g-Protein-Baked-4-oz-Bag_a0b82fba-d214-499e-aeb4-54498a2d745e.b25cdb38a8d7baa8497f8c2c949c201c.webp"
  },
  {
    "chip_name": "Thanksgiving Roast Flavor",
    "description": "\"Today's Chip of the Day captures the essence of a classic Thanksgiving feast - savory, juicy goodness that fills your cravings without the need for leftovers tomorrow. Perfectly crispy yet tender, this flavor is a feast for your taste buds!\"",
    "date": "2025-11-19",
    "image_url": "https://cdn.gardengrocer.com/attachments/photos/high_res/4315.jpg?4175"
  },
  {
    "chip_name": "Maple Apple",
    "description": "Maple Apple: A sweet fusion, this delectable treat blends crisp apple slices with warm maple syrup, making every bite a delightful adventure for your taste buds. Celebrate Global Entrepreneurship Week by savoring innovation in snack formtoday's Chip of the Day!",
    "date": "2025-11-18",
    "image_url": "https://mapleroch.com/cdn/shop/products/Maple-Roch-Apples-Product-1_1024x.jpg?v=1625351340"
  },
  {
    "chip_name": "Crispy Wasabi & Nori",
    "description": "Today's Chip of the Day, Crispy Wasabi & Nori, is a zesty twist on traditional potato chips - a perfect match for those who crave a little spice in their snack time! Enjoy this unique flavor sensation, fittingly inspired by the fiery spirit of November's energetic vibe.",
    "date": "2025-11-17",
    "image_url": "https://m.media-amazon.com/images/I/81riMxvWMiL._SL1500_.jpg"
  },
  {
    "chip_name": "Truffle Oil",
    "description": "Truffle Oil: The elegant secret ingredient that jazzes up any dish like an ace student sparks classroom discussions! This November 16th, as we celebrate education's brilliance, let Truffle Oil be your star pupil in the culinary world.",
    "date": "2025-11-16",
    "image_url": "https://mediacdn.nauticalcommerce.app/gfm/products/4c426bb2-18cb-400b-b21e-22401a17c8f6.jpg"
  },
  {
    "chip_name": "Middle Eastern Za'atar Pomegranate",
    "description": "Zesty za'atar meets sweet pomegranate in this symphony of flavors. Perfectly crisp, it's like a trip to the Middle East for National Bundt Day. Pair with creamy frosting or enjoy alone as a kitchen connection celebration bite.",
    "date": "2025-11-15"
  },
  {
    "chip_name": "Honey & Soy",
    "description": "\"Today's crunch is sweeter than a bedtime story: Honey & Soy. Dive into buttery chips swirled with golden honey and rich soy, perfect for when you're dressed in your coziest pjs. Pair with a dollop of vanilla dreams or just let them be your cuddle companion tonight!\"",
    "date": "2025-11-14",
    "image_url": "https://cdn0.woolworths.media/content/wowproductimages/large/587296.jpg"
  },
  {
    "chip_name": "Herbes de Provence",
    "description": "Today's Chip of the Day celebrates National Family Caregivers Month! Experience a burst of floral warmth in every dish with Herbes de Provence, an enchanting blend that elevates your culinary journey like a loving family embraces you.",
    "date": "2025-11-13",
    "image_url": "https://www.carredeboeuf.com/306928-large_default/chips-locavores-herbes-de-provence-125g.jpg"
  },
  {
    "chip_name": "Roast Dinner Crisp",
    "description": "Celebrate today's quirky flavors with our Roast Dinner Crisp - a delicious, savory delight that combines the classic roast beef, Yorkshire pudding magic in every bite. Today, let's give this unique 'chip of the day' a hearty welcome on National Happy Hour Day!",
    "date": "2025-11-12",
    "image_url": "https://i5.walmartimages.com/seo/Tostitos-Tortilla-Chips-Crispy-Rounds-12-oz-Bag-2-Pack_2189d477-66b4-47c4-9401-35d9f4735e3d.90b2b8679c0e0a17e74b2565c39bee72.jpeg"
  },
  {
    "chip_name": "Classic Salted Potato Chips",
    "description": "Celebrate Diwali with our Classic Salted Potato Chips spiced in true Indian glory - a crunchy delight that dances with notes of cumin and cardamom, bringing festive flavors to your crisp bite!",
    "date": "2025-11-11",
    "image_url": "https://tiimg.tistatic.com/fp/2/008/604/classic-salted-chips-401.jpg"
  },
  {
    "chip_name": "Sesame Ginger",
    "description": "Sesame Ginger, a delightful blend of sweet and spicy, is today's Chip of the Day on November 10th, celebrated as World Science Day! Embrace its unique flavor profile that pays homage to both Eastern and Western culinary traditions, making it a perfect companion for any science-themed feast.",
    "date": "2025-11-10",
    "image_url": "https://m.media-amazon.com/images/I/71-N14Ly52L._SL1500_.jpg"
  },
  {
    "chip_name": "BBQ and Cornbread",
    "description": "Today's Chip of the Day: \"BBQ & Cornbread\" - a smoky, savory delight that turns any ordinary day into a festival of flavors! Perfect for savoring with friends under the sun or stars, this culinary combo elevates dining experiences to unforgettable levels.",
    "date": "2025-11-09",
    "image_url": "https://www.ubuy.com.ph/productimg/?image=aHR0cHM6Ly9pNS53YWxtYXJ0aW1hZ2VzLmNvbS9zZW8vTGF5LXMtQmFyYmVxdWUtRmxhdm9yZWQtUG90YXRvLUNoaXBzLTItNS1vei1CYWdfMWJhOTU2MTEtMzJlMi00MTMyLWI4NDctZjg0NzljMGQ4NmU1Ljc1ZjcwNzY0M2Q2Yjk5MmU4Mjk2ODMwOTUyODY4ZTYxLmpwZWc.jpg"
  },
  {
    "chip_name": "Turkey Stuffing Chip",
    "description": "Indulge in the savory delight of Turkey Stuffing Chip - a crispy fusion of tender turkey with classic stuffing flavors. Today's unique flavor sensation celebrates culinary traditions on this 8th day of November, 2025. It's the perfect crunch for any occasion!",
    "date": "2025-11-08",
    "image_url": "https://www.allrecipes.com/thmb/fu29Iet60s2D3dJR6EU5s8yDCYY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Clancys-Turkey-Stuffing-Wavy-Potato-Chips--d7cf365d5ab74cfe99f4ae609bcfdafe.jpg"
  },
  {
    "chip_name": "Masala Twist",
    "description": "Masala Twist: Today's Chip of the Day adds a flavor explosion to your routine, perfect for National Cancer Awareness Day! Crisp, innovative, and packed with joy, this chip is a delightful reminder to savor each crunch and celebrate life's little pleasures.",
    "date": "2025-11-07",
    "image_url": "https://objectstorage.ap-mumbai-1.oraclecloud.com/n/softlogicbicloud/b/cdn/o/products/124843--01--1746422732.jpeg"
  },
  {
    "chip_name": "Teriyaki",
    "description": "Teriyaki: A delightfully savory Japanese dish, featuring tender proteins glazed with a sweet soy sauce glaze & served over rice. Its mouth-watering flavor makes it our 'Chip of the Day' on this deliciously festive $5 Thursday!",
    "date": "2025-11-06",
    "image_url": "https://atlantik-asiashop.de/cdn/shop/files/Kartoffelchipsmitteriyaki-Gewuerz100g.jpg?v=1713875261&width=1066"
  },
  {
    "chip_name": "BBQ Cheddar",
    "description": "Celebrate National Stress Awareness Day with our BBQ Cheddar Chip - a smoky twist on cheesy goodness! Today, let's embrace comfort in every bite, making stress fade away as we savor this delightful treat.",
    "date": "2025-11-05",
    "image_url": "https://mrgsnacks.com/cdn/shop/products/Mr.G-BBQCHEDDARF_1.png?v=1677794320&width=533"
  },
  {
    "chip_name": "Thai Peanut",
    "description": "\"Today, indulge in a Thai Peanut paradise! Crunch into our crispy rice treats blanketed in creamy peanut butter and zesty hints of ginger. Perfect for National Candy Day, let this sweet-savory sensation elevate your sweet tooth to new heights!\"",
    "date": "2025-11-04"
  },
  {
    "chip_name": "Maple Syrup & Bacon",
    "description": "Savor the crisp crunch of Maple Syrup & Bacontoday's Chip of the Day! A delectable twist on tradition, this chip blends sweet maple joy with smoky bacon bliss, making every bite a festive celebration without leaving your kitchen.  Perfect for your autumnal cheer or any day needing a dash of holiday magic.",
    "date": "2025-11-03",
    "image_url": "https://storage.googleapis.com/rs.dolphinfitness.com/tn1/tn1_150363058.jpg"
  },
  {
    "chip_name": "Wasabi & Soy",
    "description": "\"Wasabi & Soy elevates your taste buds like a magic sushi wand! Today's Chip of the Day celebrates National Redhead Day, so savor its bold flavors as we honor fiery red hair in all its glory!\"",
    "date": "2025-11-02",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "Cinnamon Roll Flavor",
    "description": "\"Cinnamon Roll Flavor reigns supreme on today's Chip of the Day! As we gear up for cozy winter nights and festive gatherings, this sweet delight captures the essence of early autumn transitionsperfectly blending tradition with a hint of innovation.\"",
    "date": "2025-11-01",
    "image_url": "http://shop.greyston.org/cdn/shop/files/Vegan-Cin-Blondie-Package.jpg?v=1716486804"
  },
  {
    "chip_name": "Caramel Apple Corn",
    "description": "Savor the spooktacular twist on a classic: Caramel Apple Corn, crispy kernels coated in a velvety caramel with a touch of cinnamon, the perfect crunch for your Halloween night munchies!",
    "date": "2025-10-31",
    "image_url": "https://i5.peapod.com/c/9J/9JEWA.png"
  },
  {
    "chip_name": "Spicy Pumpkin",
    "description": "Spicy Pumpkin, today's Chip of the Day, isn't just a snack; its a bold celebration of autumn! A perfect blend of fiery heat and sweet pumpkin delight, it's like dancing with leaves on National Candy Corn Daysweetly rebellious yet oh-so-tasty!",
    "date": "2025-10-30",
    "image_url": "https://myscrapchick.com/wp-content/uploads/2023/07/Halloween-Chip-Bags-Set-1536x1536.jpg"
  },
  {
    "chip_name": "Mexican Chorizo & Lime",
    "description": "\"Sizzling chorizo meets tangy lime in each crispy bite. It's National Cat Daypurr-fect for a feline-approved snack that'll have you howling for more.\"",
    "date": "2025-10-29"
  },
  {
    "chip_name": "Greek Olive Oil & Oregano",
    "description": "Today's Chip of the Day is Greek Olive Oil & Oregano - a flavorful duo that not only elevates dishes but honors culinary traditions, just like our modern-day heroes on National First Responders Day. It brings bold tastes from ancient lands to every meal, celebrating diversity akin to our global connections on National Immigrants Day.",
    "date": "2025-10-28",
    "image_url": "https://m.media-amazon.com/images/I/51kht5qK2IL._SL500_.jpg"
  },
  {
    "chip_name": "Spiced Cider",
    "description": "Savor the cozy magic of Spiced Cidertoday's delightful Chip of the Day! As we celebrate Global Warmth Appreciation Week, this comforting beverage warms hearts & chilly fingers alike on October 27, 2025, turning everyday moments into enchanting tales.",
    "date": "2025-10-27",
    "image_url": "https://gourmetchipcompany.com/cdn/shop/files/Maskgroup-21.png?v=1713728985&width=1445"
  },
  {
    "chip_name": "Spiced Apple Cinnamon",
    "description": "Savor the warmth of Spiced Apple Cinnamon  a delightful autumn delight that's today's Chip of the Day! Its cozy blend of spices pairs perfectly with crisp October air, making every bite feel like a celebration of seasonal flavors.",
    "date": "2025-10-26",
    "image_url": "https://cfrouting.zoeysite.com/cdn-cgi/image/fit=scale-down,width=1200,format=auto,quality=70/https://s3.amazonaws.com/zcom-media/sites/a0iE000000DLG1UIAX/media/catalog/product/0/_/0_34000_45519_5_701_45519_001_item_front.jpg"
  },
  {
    "chip_name": "Fall Harvest Mix",
    "description": "Our Fall Harvest Mix is a delightful blend of cozy flavors, perfect for autumn's crisp air. It's this month's Chip of the Day, celebrating all that brings - warmth in every bite!",
    "date": "2025-10-25",
    "image_url": "https://m.media-amazon.com/images/I/818B5OHOp-L._AC_.jpg"
  },
  {
    "chip_name": "Cinnamon Apple",
    "description": "Cinnamon Apple: Today's Chip of the Day, a sweet surprise that bursts with warm spices in every bitelike a cozy hug from autumn itself!  Dive into its spicy-sweet charm, perfect for these crisp October days.",
    "date": "2025-10-24",
    "image_url": "https://bigbigmart.com/wp-content/uploads/2022/05/1-452.jpg"
  },
  {
    "chip_name": "Pumpkin Spice",
    "description": "Today's \"Chip of the Day\" is Pumpkin Spice - a warm autumn blend that evokes cozy feelings like a hug from an old friend on a chilly day. Perfectly fitting for this October 23, 2025 date, as we've navigated through months with unique Latin origins, Pumpkin Spice stands as a delightful reminder of our year's journey.",
    "date": "2025-10-23",
    "image_url": "https://s3.amazonaws.com/grocery-project/product_images/great-value-pumpkin-spice-baki-3251722-12149821.jpg"
  },
  {
    "chip_name": "Tikka Masala",
    "description": "\"Curry kissed with heat and spices, this chip's bold flavor dance is perfect for today's Global Diversity Day. Let it lead your palette to new culinary heights, perhaps paired with a creamy mango chutney dip.\"",
    "date": "2025-10-22",
    "image_url": "https://i.ebayimg.com/images/g/FwQAAOSwmy9nbLP2/s-l1600.jpg"
  },
  {
    "chip_name": "Thai Lemongrass Crisp",
    "description": "Lemongrass whispers its exotic essence into every crunch. Celebrate the Tamil Nadu holiday in crispy delight, where zesty Thai flavors dance on your taste buds and transport you to a festival of flavors. Perfect for dipping in coconut milk or enjoying with a cold craft beer, this chip is the festive snack that elevates any celebration!",
    "date": "2025-10-21"
  },
  {
    "chip_name": "Saffron Sea Salt",
    "description": "Celebrating both flavor's and chefs on this day, October 20th marks a unique blend - Saffron Sea Salt! A fusion of vibrant saffron essence with ocean-sourced salt, it elevates every dish like no other, earning its spot as todays Chip of the Day. Perfect for those who love to spice up their culinary creations.",
    "date": "2025-10-20",
    "image_url": "https://i.pinimg.com/originals/2f/33/96/2f33962231e1d5d67dc6ea39e8e28e88.jpg"
  },
  {
    "chip_name": "Wasabi & Pickled Ginger",
    "description": "\"Zesty wasabi meets tangy pickled ginger in this flavor fusion. A fiery journey for your taste buds, perfect for sparking up any discussion at Free Speech Week.\"",
    "date": "2025-10-19",
    "image_url": "https://m.media-amazon.com/images/I/71-N14Ly52L._SL1500_.jpg"
  },
  {
    "chip_name": "Wasabi & Truffle",
    "description": "\"Wasabi & Truffle: The dynamic duo of flavor! A perfect blend of fire and finesse, making every bite a burst of excitement. Today's Chip of the Day, because sometimes your taste buds need a daring adventure!\"",
    "date": "2025-10-18",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "Wasabi & Soy",
    "description": "Wasabi & Soy celebrates a perfect blend of fiery and smooth flavors - today's Chip of the Day! On this culinary adventure, October 17th brings us National Pasta Day, making every bite even more delightful with its vibrant taste explosion. A true masterpiece in fusion cuisine, it's a versatile delight that transcends borders, just like global events on this day.",
    "date": "2025-10-17",
    "image_url": "https://img.lazcdn.com/g/p/0eb131af0d5fc26bfac1516dc10f2299.jpg_720x720q80.jpg"
  },
  {
    "chip_name": "Wasabi Nori",
    "description": "\"Wasabi Nori takes sushi to another dimension on National Boss's Day, 16th of October 2025, by adding a zesty kick with its spicy wasabi spreadbecause great bosses deserve a taste of adventure! \"",
    "date": "2025-10-16",
    "image_url": "https://media.cdn.kaufland.de/product-images/1024x1024/c573e6f99a2df2a642753d58a336c52c.jpg"
  },
  {
    "chip_name": "Pumpkin Spice",
    "description": "Today, October 15, 2025, marks the essence of autumn with \"Pumpkin Spice\" as our Chip of the Day - a delightful blend of cozy spices that transforms every sip or nibble into a warm embrace of fall flavors. Cheers to spreading the joy of this iconic seasonal sensation!",
    "date": "2025-10-15",
    "image_url": "https://i.pinimg.com/originals/8f/24/36/8f2436871da03d7c06a27e3784e2dcc7.jpg"
  },
  {
    "chip_name": "Wasabi Ginger",
    "description": "Today's Chip of the Day is Wasabi Ginger: a bold fusion of fiery wasabi spice and zesty ginger, creating an electrifying sensation in your mouth that matches perfectly with the fiery spirit of National Dessert Day!",
    "date": "2025-10-14",
    "image_url": "https://s3-media0.fl.yelpcdn.com/bphoto/G7l0tiLx5t4xjVA-4NW4HQ/1000s.jpg"
  },
  {
    "chip_name": "Brie & Honey Truffle",
    "description": "\"Brie's creaminess meets honey's sweetness in a truffle-kissed embrace. The perfect savory-sweet holiday bite, celebrating Columbus Day with a touch of opulence and a pinch of adventure.\"",
    "date": "2025-10-13"
  },
  {
    "chip_name": "Tortilla Tajin",
    "description": "Tortilla Tajin: Crispy delight meets tangy excitement! A classic Mexican-spicy twist inspired by Spain's vibrant flavors, perfect for Hispanic Day 2025 celebrations - because every bite is a celebration of culture! SPANISH DAY FEELZ",
    "date": "2025-10-12",
    "image_url": "https://assets.biglots.com/is/image/biglots/810475469"
  },
  {
    "chip_name": "Kale & Sea Salt",
    "description": "Celebrate National Coming Out Day with our Kale & Sea Salt Kettle Chipscrisp and crunchy, with a touch of briny sweetness. The perfect pairing for a night of self-expression and celebration, as bold as your identity.",
    "date": "2025-10-11"
  },
  {
    "chip_name": "Japanese Wasabi Miso",
    "description": "Japanese Wasabi Miso: A fiery fusion of traditional flavors that packs a punch, blending earthy miso with zesty wasabi for a delightfully dynamic taste experience. Perfectly paired for today's culinary adventure on October 10, 2025!",
    "date": "2025-10-10",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "Masala & Mango Chutney",
    "description": "Today's Chip of the Day is Masala & Mango Chutney - a vibrant fusion of spicy Indian flavors & sweet tropical mangoes! Perfectly paired for National Potato Chip Day, this chip adds bold zest to every crunch.",
    "date": "2025-10-09",
    "image_url": "https://p.globalsources.com/IMAGES/PDT/B6024213660/Lays-Potato-Chips-Flamin-Hot-Flavored-Snacks.jpg"
  },
  {
    "chip_name": "Apple Cider Vinegar",
    "description": "Today, October 8th, is National Apple Cider Vinegar Day! Cheers to this tangy wonder that not only adds zest to your meals but also boasts health benefits like boosting digestion and aiding in weight loss, making it a tasty and healthy chip of the day.",
    "date": "2025-10-08",
    "image_url": "https://www.harrisfarm.com.au/cdn/shop/products/16213-done_grande.jpg?v=1620186536"
  },
  {
    "chip_name": "Teriyaki",
    "description": "\"Today, let's savor teriyaki perfection in every bite! Sweet, savory, and oh-so-satisfying, these rice crisps are your secret weapon for raising awareness on National Inner Beauty Day. Pair them with a glass of milk or dive into an umami-packed ramen bowl. A crispy journey to self-love awaits.\"",
    "date": "2025-10-07",
    "image_url": "https://sweetfusion.net/wp-content/uploads/2024/06/Lays-Subway-Restaurant-Teriyaki-Chips-150g-SweetFusion-Calgary-min.png"
  },
  {
    "chip_name": "German Chocolate",
    "description": "German Chocolate: A rich, decadent treat with a history as sweet as its German roots. Perfectly fitting for National German-American Day, this chocolatey delight is the star of today's dessert scene!",
    "date": "2025-10-06",
    "image_url": "https://www.tastingtable.com/img/gallery/the-big-brand-that-replaced-costcos-kirkland-signature-chocolate-chips/intro-1742408304.jpg"
  },
  {
    "chip_name": "Spiced Pumpkin Seed",
    "description": "Today's Chip of the Day is Spiced Pumpkin Seed! A delightful autumn treat packed with warm spices that'll have you feeling all cozy and nostalgicjust in time for Halloween. Dive into October with this crunchy, flavorful snack, making every bite a mini celebration of fall flavors!",
    "date": "2025-10-05",
    "image_url": "https://images.squarespace-cdn.com/content/v1/5ac261cf71069968df1e61a9/471ec87e-8ea3-4ab6-8db8-5a984516d9e2/DSC06146.jpg"
  },
  {
    "chip_name": "Almond Joy Chip",
    "description": "Almond hugs coconut's sweet heart in every crunch, paired with a drizzle of decadent chocolate. National Cinnamon Roll Day just got sweeter.",
    "date": "2025-10-04"
  },
  {
    "chip_name": "Bratwurst",
    "description": "Celebrate German Unity Day with our crunchy, bite-sized Bratwurst chips - sizzling with smoky flavors, these chips are a spicy delight that'll make you feel like you're in Oktoberfest right here!",
    "date": "2025-10-03",
    "image_url": "https://product.hstatic.net/200000718991/product/3_37bf72747e624591be3104ff1556d986_master.png"
  },
  {
    "chip_name": "Crispy Maple Bacon",
    "description": "Crispy Maple Bacon: A delightful fusion of sweet and savory heaven, where smoky bacon meets velvety maple essence. Today's Chip of the Day for October 2, 2025, brings a twist on classic flavors that'll make your taste buds dance - just like how a chip might pop in and out of an autumn bonfire glow!",
    "date": "2025-10-02",
    "image_url": "https://calibagels.com/cdn/shop/files/a.png?v=1722004600&width=1445"
  },
  {
    "chip_name": "Kung Pao Chicken Flavored",
    "description": "Celebrate National Day with a crunchy delight that's spicy and bold - Kung Pao Chicken Flavored Chip! Perfectly capturing the essence of China's vibrant cuisine, each bite bursts with authentic flavors, making this the perfect snack for your festive feast.",
    "date": "2025-10-01",
    "image_url": "https://digitalassets.pepsico.com/m/2133570360248267/Hi_Res-00028400768672_C1C1.jpg"
  },
  {
    "chip_name": "Turmeric & Ginger",
    "description": "Golden-hued bursts of spice in every crunch, celebrating the heart of today's love. Dive into Turmeric & Ginger's zesty embrace and let your taste buds dance to the rhythm of Celebration Nation on National Love People Day. Perfect for a dip in creamy goodness or as an occasion to share with those you cherish, it's more than just chips; it's a celebration of connection.",
    "date": "2025-09-30",
    "image_url": "https://m.media-amazon.com/images/I/71-N14Ly52L._SL1500_.jpg"
  },
  {
    "chip_name": "Chickpea Pita Chips with Za'atar",
    "description": "Today's Chip of the Day: Chickpea Pita Chips with Za'atar - A Levantine delight that travels through time from ancient Rome to modern kitchens. Crispy, nutty, and bold, these chips are a fusion of history and flavor. Pair them with creamy labneh or tangy hummus for a feast fit for the gods!",
    "date": "2025-09-29"
  },
  {
    "chip_name": "International Poke Day - Tuna & Avocado",
    "description": "International Poke Day celebrates the versatile dish, today spotlighting a scrumptious Tuna & Avocado combo - a refreshing twist on this beloved Hawaiian staple! Savor its simplicity and zesty flavors; it's the perfect palate pleaser for culinary adventurers worldwide!",
    "date": "2025-09-28",
    "image_url": "https://d2lnr5mha7bycj.cloudfront.net/product-image/file/large_9583aeb1-df7a-4f1d-bd0d-121caaef6e1d.jpeg"
  },
  {
    "chip_name": "Herbes de Provence Truffle",
    "description": "\"Unveiling today's Chip of the Day: Herbes de Provence Truffle! A delightful fusion of traditional herbs with a touch of luxurious truffle essence, this chip is a culinary adventure that transports you straight to the heart of Frances sun-kissed landscapes. Perfectly paired for those seeking flavors that are both elegant and memorable.\"",
    "date": "2025-09-27",
    "image_url": "https://www.olive-et-raisin.com/wp-content/uploads/2022/03/10-8.png"
  },
  {
    "chip_name": "Mexican Potato Queso, Chipotle Lime",
    "description": "Today's Chip of the Day is a spicy twist on Mexican tradition - the \"Mexican Potato Queso, Chipotle Lime\"! A delightful blend of creamy queso with zesty chipotle peppers & tangy lime flavors, this treat is like a fiesta in your mouth, celebrating the vibrant tastes of September 2025.",
    "date": "2025-09-26",
    "image_url": "https://cdn.faire.com/fastly/d0af889ca9008364bdbec406bf9218dadaeffc579fb209f69341d791c6d271b2.png?bg-color=FFFFFF&dpr=1&fit=crop&format=jpg&height=720&width=720"
  },
  {
    "chip_name": "Teriyaki Nori",
    "description": "\"Today, Teriyaki Nori chips celebrate National Comic Book Day. Savor their umami-rich crunch, like flipping through your favorite panels  but better, because they're snackable.\"",
    "date": "2025-09-25",
    "image_url": "https://www.drogist.nl/dynamisch/bibliotheek/cache/800_800_3_422897_0_nl_sea_crunchy_nori_zeewier_snacks_teriyaki_10g.jpg"
  },
  {
    "chip_name": "Wasabi & Rice",
    "description": "Today's Chip of the Day is Wasabi & Rice - a fiery fusion that dances on your taste buds! A delightful explosion of flavors fit for the adventurous spirit of September 2025, making every bite as unique as the day itself.",
    "date": "2025-09-24",
    "image_url": "https://www.instacart.com/image-server/1200x1200/www.instacart.com/assets/domains/product-image/file/large_1400fda4-9990-484a-b065-677c33c69e11.JPG"
  },
  {
    "chip_name": "Mango Chutney",
    "description": "Mango Chutney reigns supreme as today's Chip of the Day, offering a sweet-savory dance on your palate that's both zesty and exotic - the perfect squeeze of sunshine for any dish needing a little tropical flavor boost! September 23, 2025, feels a bit like summer lingering in a crisp autumn breeze, making this golden elixir a delightful reminder of sunny days.",
    "date": "2025-09-23",
    "image_url": "https://media.naheed.pk/catalog/product/cache/2f2d0cb0c5f92580479e8350be94f387/1/2/1288963-1.jpg"
  },
  {
    "chip_name": "Lemongrass & Ginger",
    "description": "\"Unleash the zesty duo of lemongrass and ginger in every bite. This fusion of citrusy tang and spicy warmth is perfect for a night in, celebrating National Girls' Night. Pair with your favorite dips or just savor solo; it's the ultimate flavor adventure for bonding and relaxation.\"",
    "date": "2025-09-22",
    "image_url": "https://m.media-amazon.com/images/I/71-N14Ly52L._SL1500_.jpg"
  },
  {
    "chip_name": "Gochujang",
    "description": "Today's Chip of the Day: Gochujang! It's more than just a spicy Korean ingredient; it's like adding a peace-loving, flavor-popping ninja to your kitchen arsenal on World Peace Day! Spice up your recipes without causing conflict - just a little dab goes a long way.",
    "date": "2025-09-21",
    "image_url": "https://prod-spinneys-cdn-new.azureedge.net/media/images/products/2025/08/733603101064_21sflJB.jpg"
  },
  {
    "chip_name": "Wasabi & Green Tea",
    "description": "Wasabi & Green Tea: A zesty yet soothing duo, perfect for today's National Queso Day, blending fiery excitement with a cooling twist, making every bite a unique adventure in flavor!",
    "date": "2025-09-20",
    "image_url": "https://cdn.nijiya.com/vv9mmlvkff3n55eatq1e9bzmjb50"
  },
  {
    "chip_name": "Red Wine Vinegar & Spanish Paprika",
    "description": "Celebrate International Grenache Day on September 19th, 2025 by savoring this delightful red wine grape's versatility in vino tinto and Spanish paprika dishes! Today, let's toast to the flavors of the world with a twist of pirate flair. Happy sailing, Grenache lovers!",
    "date": "2025-09-19",
    "image_url": "https://inrorwxhkliplp5p.ldycdn.com/cloud/llBpoKoolpSRpkrpkkjqip/plain-chip-bags.jpg"
  },
  {
    "chip_name": "Barbecue BBQ",
    "description": "Celebrate today's Independence Day in Chile with Barbecue BBQ's Asado Chileno-flavored chips - a spicy, smoky explosion that pays tribute to the flavors of this festive day!",
    "date": "2025-09-18",
    "image_url": "https://i5.walmartimages.com/asr/7e70b520-32ca-4a8f-8656-13a59f183a20.4436a6b292942c05d18c46701fdff99a.jpeg?odnHeight=372&odnWidth=372&odnBg=FFFFFF"
  },
  {
    "chip_name": "Herbes de Provence with Truffle Oil",
    "description": "Today's Chip of the Day is \"Herbes de Provence with Truffle Oil\" - a gourmet twist on classic flavors! This unique blend elevates dishes with earthy truffles and aromatic herbs, making every bite a delightful adventure in taste. Dive into culinary bliss with this limited edition flavor, perfect for fall dishes.",
    "date": "2025-09-17",
    "image_url": "https://mediacdn.nauticalcommerce.app/gfm/products/4c426bb2-18cb-400b-b21e-22401a17c8f6.jpg"
  },
  {
    "chip_name": "Chili Lime",
    "description": "Celebrate Mexico's independence with a zesty 'Chili Lime' Chip - a fiery, tangy treat that dances on your taste buds, making every bite as vibrant as the country's flag! Perfect for your festive fe...",
    "date": "2025-09-16",
    "image_url": "https://i5.walmartimages.com/seo/Tostitos-Hint-of-Chili-Lime-Flavored-Tortilla-Chips-11-oz-Bag_fab51705-ffbf-4ca2-9213-6f411dee1ad3.4a38513c2bb41d7f68a3a96779aeb7fe.jpeg"
  },
  {
    "chip_name": "Herbs of Provence Truffle Oil",
    "description": "\"Indulge in culinary magic with our Herbs of Provence Truffle Oil - a premium blend that elevates any dish from mundane to masterpiece! Celebrating National Cheese Toast Day, make every bite a luxurious adventure in flavor. Today, let's savor the essence of truffles on your cheese toast and beyond.\"",
    "date": "2025-09-15",
    "image_url": "https://jororwxhkliplp5p.ldycdn.com/cloud/llBpoKoolpSRojljjrnkiq/customized-chip-bags.jpg"
  },
  {
    "chip_name": "Truffle Rosemary",
    "description": "Truffle Rosemary: The gourmet delight that elevates every bite! With its rich, earthy truffle flavor married to the fragrant, herbal notes of rosemary, this season's Chip of the Day transforms any dish into a culinary masterpiece, perfect for adventurous eaters ready to savor the essence of autumn.",
    "date": "2025-09-14",
    "image_url": "http://cdn.shopify.com/s/files/1/0614/8309/0107/products/Savoursmiths-Truffle-Rosemary-Potato-Chips-5-29oz-Bags-12ct-CandyStore-com-571_1200x1200.jpg?v=1677173559"
  },
  {
    "chip_name": "Truffle Pecan",
    "description": "\"Toast to tradition and luxury with every crisp bite of Truffle Pecan. Rich earthiness meets crunchy perfection, just right for pondering life's great questionsor simply savoring a moment of pure indulgence.\"",
    "date": "2025-09-13"
  },
  {
    "chip_name": "Herbes de Provence Truffle",
    "description": "Today's Chip of the Day celebrates culinary creativity with \"Herbes de Provence Truffle,\" a flavor fusion that takes classic herbed seasoning to new heights by incorporating truffle essence. It's like sprinkling sunshine on your plate!  gastronomic adventure awaits.",
    "date": "2025-09-12",
    "image_url": "https://mediacdn.nauticalcommerce.app/gfm/products/4c426bb2-18cb-400b-b21e-22401a17c8f6.jpg"
  },
  {
    "chip_name": "Garam Masala",
    "description": "Garam Masala: The vibrant spice blend that adds a warm hug of flavor to dishes, reminding us daily to savor life's flavors just as we cherish each September 11th, celebrating resilience and unity across our nations.  Patriotically proud!",
    "date": "2025-09-11",
    "image_url": "https://5.imimg.com/data5/II/YS/TD/SELLER-1750913/anu-garam-masala-1000x1000.jpeg"
  },
  {
    "chip_name": "Jalapeño & Lime",
    "description": "Today's Chip of the Day is a fiery delight - Jalapeo & Lime! Bursting with zesty flavor, this snack adds a spicy twist to your usual chips, making National Swap Ideas Day even more exciting with its unique taste that's sure to spark some culinary creativity.",
    "date": "2025-09-10",
    "image_url": "https://m.media-amazon.com/images/I/71cPg7oGx4L._SL1500_.jpg"
  },
  {
    "chip_name": "Spiced Sesame & Ginger",
    "description": "Culinary Fusion: Spiced Sesame & Ginger, our Chip of the Day, is a vibrant blend that transforms your taste buds into global adventurers! This September 2025 delight seamlessly merges bold flavors from East and West for an unforgettable bite.",
    "date": "2025-09-09",
    "image_url": "https://cdn.globalso.com/packaging-bag/3chips.jpg"
  },
  {
    "chip_name": "Sriracha",
    "description": "\"Sriracha: The fiery little red chip that's lighting up our taste buds, blending seamlessly into our culinary lives like a tech gadget enhancing every moment. A daily delight for those who dare to spice things up!\"",
    "date": "2025-09-08",
    "image_url": "http://www.candystore.com/cdn/shop/products/Dirty-Sriracha-Honey-Potato-Chips-2oz-Bags-25ct-CandyStore-com-177_1200x1200.jpg?v=1677134076"
  },
  {
    "chip_name": "Feijoada Frico",
    "description": "Feijoada Frico: Freedom fries for Independence Day, crispy with Brazilian soul, celebrating freedom of flavor on this festive day!",
    "date": "2025-09-07",
    "image_url": "https://snacksmexico.com/cdn/shop/products/il_fullxfull.4135556423_3fy2.jpg?v=1674582178"
  },
  {
    "chip_name": "Sour Cream & Onion Truffle",
    "description": "\"Sour Cream & Onion Truffle takes your snack game to a gourmet level. This delightful chip is today's star, blending creamy indulgence with zesty onion notes - perfect for connoisseurs craving a sophisticated crunch.\"",
    "date": "2025-09-06",
    "image_url": "https://mediacdn.nauticalcommerce.app/gfm/products/4c426bb2-18cb-400b-b21e-22401a17c8f6.jpg"
  },
  {
    "chip_name": "Jalapeño & Mango",
    "description": "Today's Chip of the Day is 'Jalapeo & Mango' - a spicy yet sweet sensation that embodies the spirit of National Actdumb Day with its bold fusion flavors, perfect for celebrating on this quirky September 5th!",
    "date": "2025-09-05",
    "image_url": "https://m.media-amazon.com/images/I/71pEVZZ+aJL._SL1500_.jpg"
  },
  {
    "chip_name": "Lemongrass Thai Chips",
    "description": "National Wildlife Day Special: 'Lemongrass Thai Chips' - A zesty dance of citrus zest and Thai spices, in crunchy delight. Pair with a cool coconut milk dip for a tropical adventure in every bite!",
    "date": "2025-09-04"
  },
  {
    "chip_name": "Pumpkin Spice & Cinnamon",
    "description": "Pumpkin Spice & Cinnamon: The cozy blend that brings warmth to your day, like a hug from an old friend. Perfectly captures fall's essence on our Chip of the Day!",
    "date": "2025-09-03",
    "image_url": "https://i.pinimg.com/736x/a4/b5/6b/a4b56bcfd3a9832ecb886ec2194a7e0f.jpg"
  },
  {
    "chip_name": "Maple & Bacon",
    "description": "\"Maple & Bacon: A heavenly duo where sweet meets savory. It's not just breakfast anymore; it's a flavor sensation for any time of day! Celebrated as our quirky Chip of the Day, because why not indulge in something utterly delightful on World Coconut Day?\"",
    "date": "2025-09-02",
    "image_url": "https://cdn.shopify.com/s/files/1/0722/7781/9666/products/maple.jpg?v=1677401310&width=823"
  },
  {
    "chip_name": "Teriyaki Nori",
    "description": "Celebrate National Tofu Day by savoring crispy bites of Teriyaki Nori  a delightful fusion snack that's become this years Chip of the Day! Enjoy its unique blend of savory teriyaki flavors wrapped in crunchy nori seaweed, making every bite as satisfying as a perfect day in September.",
    "date": "2025-09-01",
    "image_url": "https://www.drogist.nl/dynamisch/bibliotheek/cache/800_800_3_422897_0_nl_sea_crunchy_nori_zeewier_snacks_teriyaki_10g.jpg"
  },
  {
    "chip_name": "August Apple Cinnamon Crunch",
    "description": "August Apple Cinnamon Crunch: A delightful medley of crisp apples and warm cinnamon, wrapped in a layer of smooth chocolate. This sweet snack reminds us that harmony can be as delicious as a cleverly balanced agreement on peace initiatives. Try some today!",
    "date": "2025-08-31",
    "image_url": "https://m.media-amazon.com/images/I/61YBnv7mHCL._AC_.jpg"
  },
  {
    "chip_name": "BBQ Pulled Pork",
    "description": "Savor the smoky delight of BBQ Pulled Pork, the soulful star of today's culinary celebration - making every bite as memorable as a thunderous motorcycle rumble!",
    "date": "2025-08-30",
    "image_url": "https://m.media-amazon.com/images/I/81Z6zza7K1L._SL1500_.jpg"
  },
  {
    "chip_name": "Slovakian Paprika",
    "description": "\"Slovakian Paprika: The fiery secret ingredient that adds zing to dishes worldwide, today celebrated as a symbol of unity against global threats like nuclear weapons through diplomacy. It's not just a spice; it's a diplomatic tool!\"",
    "date": "2025-08-29",
    "image_url": "https://eu-central-1.linodeobjects.com/klas/attachments/39/9785/87644636-385f-4687-a211-9ae4283529dc.jpg"
  },
  {
    "chip_name": "Alpine Herb Truffle",
    "description": "\"Underneath the alpine sky, crisp truffles dance with herbs. Celebrate peace withbite of earthy richness and a touch of harmony.\"",
    "date": "2025-08-28"
  },
  {
    "chip_name": "Wasabi & Green Tea",
    "description": "Savor the zesty kick of Wasabi paired with a soothing cup of Green Tea; this dynamic duo not only fights off any dull moments on National Bananas Lovers Day (August 27, 2025) but also adds a touch of global flavor that makes it todays quirky Chip of the Day!",
    "date": "2025-08-27",
    "image_url": "https://img.lazcdn.com/g/p/0eb131af0d5fc26bfac1516dc10f2299.jpg_720x720q80.jpg"
  },
  {
    "chip_name": "Chili Lime",
    "description": "Today's Chip of the Day, Chili Lime, is a zesty blend that adds a burst of tangy-sweet flavor to dishes, making every bite as exciting as a summer day in August 2025just what you need when historical stories about July and August seem too tame by comparison!",
    "date": "2025-08-26",
    "image_url": "https://i5.walmartimages.com/seo/Lay-s-Chile-Lim-n-Flavored-Potato-Chips-1PACK_7d29c4b8-4a4c-485d-9183-f3056b4fa403.05600f6e7a4b08499279114e2e358499.jpeg"
  },
  {
    "chip_name": "Wasabi & Green Tea",
    "description": "\"Wasabi & Green Tea: A fiery duo that's as daring as today's bold celebrations! Perfectly spicy yet refreshing, this dynamic duo makes your taste buds dance on National Kiss And Make Up Day.\"",
    "date": "2025-08-25",
    "image_url": "https://img.lazcdn.com/g/p/0eb131af0d5fc26bfac1516dc10f2299.jpg_720x720q80.jpg"
  },
  {
    "chip_name": "Herbs of Provence Truffle",
    "description": "Unleash the rich, velvety essence of Provence's finest culinary secrets with 'Herbs of Provence Truffle'the star seasoning for gourmet dishes this National Radio Day! Perfectly blending truffle flavors with traditional herbs, its like tuning into a smooth jazz station on your palate.",
    "date": "2025-08-24",
    "image_url": "https://down-my.img.susercontent.com/file/3b65bec8cb89f9a308eb8ed18f9c826d"
  },
  {
    "chip_name": "Classic BBQ",
    "description": "Classic BBQ - Timeless taste, today's sizzling highlight! This smoky delight, a staple of summer flavors, brings friends together with its comforting aroma, proving that tradition reigns supreme in culinary joy.",
    "date": "2025-08-23",
    "image_url": "https://cdn.gardengrocer.com/attachments/photos/high_res/4315.jpg?4175"
  },
  {
    "chip_name": "Mexican Potato Queso",
    "description": "Mexican Potato Queso: Today's savory Chip of the Day is a scrumptious twist on nacho night! This hearty blend of creamy queso with tender potatoes and zesty Mexican flavors is like a fiesta in your mouth. Perfect for any occasion, it's this month's July-August special, combining bold tastes as rich and complex as our history.",
    "date": "2025-08-22",
    "image_url": "https://shop.herrs.com/cdn/shop/files/herrs-gameday-flavors-loaded-queso-chips-7-oz-bag_1080x.png?v=1756224140"
  },
  {
    "chip_name": "Sea Salt Caramel Corn",
    "description": "Savor today's crunchy delightSea Salt Caramel Corn! A scrumptious symphony of crispy corn kernels wrapped in velvety caramel sauce, then sprinkled with just a pinch of sea salt for a touch of oceanic elegance. This classic confection is the perfect blend of sweet and salty, making every bite a delightful adventure on your taste buds!",
    "date": "2025-08-21",
    "image_url": "https://www.allrecipes.com/thmb/JZYMhHOeSbMmH807KhTzacha01U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ar-taste-test-corn-chips-great-value-crunchy-corn-chips-121fd1b96cf045b58f42f2e36d680527.jpg"
  },
  {
    "chip_name": "Tajín Chipotle",
    "description": "\"Rumble through time to the spice routes of old. This crispy tortilla chip meets smoky chipotle, a fiery toast to Hungary's bold history. Pair it with a zesty dip and let flavor fireworks ensue on National State Day!\"",
    "date": "2025-08-20"
  },
  {
    "chip_name": "August Breeze BBQ",
    "description": "August Breeze BBQ ignites summer flavors with a lively twisttoday's Chip of the Day, blending traditional BBQ delights with innovative sauces, ensuring each bite sizzles with joy!",
    "date": "2025-08-19",
    "image_url": "https://i5.walmartimages.com/seo/SunChips-Whole-Grain-Snacks-Honey-BBQ-Flavored-7-Ounce-Bag_ea206212-8c3c-4d1b-accf-e9fff6c0992a.beb87a5d4014721675b2dbb9f9c422df.jpeg"
  },
  {
    "chip_name": "Wasabi Green Tea",
    "description": "Experience a delightful fusion of tradition and zing with Wasabi Green Tea - today's Chip of the Day! This unique blend invigorates your senses like no other, offering a fresh twist on classic green tea flavors that'll have you craving for more. Dive into summer 2025 with this modern classic!",
    "date": "2025-08-18",
    "image_url": "https://www.foodello.be/tuotekuvat/6932430200368.png"
  },
  {
    "chip_name": "Ayam Goreng",
    "description": "For Independence Day 2025, let's celebrate with a crispy bite of Ayam Gorengspicy fried chicken that pops with the flavors of Indonesia, perfect for cheering on our freedom with every crunchy crunch! IDNDPDT2025",
    "date": "2025-08-17",
    "image_url": "https://kelokal.com/wp-content/uploads/2022/12/MISTER-POTATO-CHIPS-SYOK-WAVE-AYAM-GORENG-BERAPI-FLAVOR-SNACK-65G-600x600.jpg"
  },
  {
    "chip_name": "BBQ Pulled Pork",
    "description": "Savor the slow-smoked magic of BBQ Pulled Pork todaythe \"Chip of the Day,\" where every bite is a celebration of fall-off-the-bone tenderness and smoky delight! Let its rich flavors add zest to your Work From Home for Wellness routine, making every bite a little reminder of summer's best.",
    "date": "2025-08-16",
    "image_url": "https://i5.walmartimages.com/seo/Ruffles-Flamin-Hot-BBQ-Flavored-Potato-Snack-Chips-8-Ounce-Bag_694a719d-1be1-4965-a5e5-4e67d8a36221.89cfc8736b01c39f20695f69eeabdb4c.jpeg"
  },
  {
    "chip_name": "Masala Twist",
    "description": "Celebrate India's independence with Masala Twist: crispy, flavorful chips infused with exotic spices like cumin, cardamom & coriander, for a taste of vibrant Indian flavors in every bite!",
    "date": "2025-08-15",
    "image_url": "https://m.media-amazon.com/images/I/513Kf-zHi+L._SY300_SX300_.jpg"
  },
  {
    "chip_name": "Herbes de Provence",
    "description": "Today's Chip of the Day brings a pinch of sunshine from Provence - Herbes de Provence! Celebrate Pakistan's Independence Day with this flavorful mix, adding vibrant zest to your dishes like a pop of joy on August 14, 2025.",
    "date": "2025-08-14",
    "image_url": "https://m.media-amazon.com/images/I/91cZrLXeapL._SL1500_.jpg"
  },
  {
    "chip_name": "Sesame Ginger & Wasabi",
    "description": "Savor the fusion of bold flavors with our Sesame Ginger & Wasabi chiptoday's Chip of the Day! A delightful symphony on your palate for National Prosecco Day, celebrating life's little luxuries and diverse tastes.",
    "date": "2025-08-13",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  },
  {
    "chip_name": "August Apple Cinnamon Crunch",
    "description": "Today's Chip of the Day: August Apple Cinnamon Crunch. Celebrate the month with a delightful snack that brings the warmth of cinnamon and the crisp sweetness of applesperfectly timed for when summer meets fall!",
    "date": "2025-08-12",
    "image_url": "https://m.media-amazon.com/images/I/61YBnv7mHCL._AC_.jpg"
  },
  {
    "chip_name": "Atomic BBQ",
    "description": "Atomic BBQ: Smoldering in flavor, this culinary delight ignites taste buds with its smoky essence! It's not just a meal; it's today's Chip of the Day for being as unforgettable as that surprise fireworks show at midnight.",
    "date": "2025-08-11",
    "image_url": "https://www.snacks.com/_next/image?url=https://digitalassets.pepsico.com/m/16e2172d26b7495d/Std_Res-00028400762373_C1C1.jpg&w=3840&q=75"
  },
  {
    "chip_name": "Sesame Ginger",
    "description": "\"Sesame Ginger\" is today's Chip of the Day because, unlike July and August which might seem like random months added to our calendar, \"Sesame Ginger\" brings a delightfully spicy twist that's both unexpected and oh-so satisfying! Perfectly blending fun flavors, just like finding quirky facts about our years timeline adds depth to our understanding.",
    "date": "2025-08-10",
    "image_url": "https://m.media-amazon.com/images/I/71-N14Ly52L._SL1500_.jpg"
  },
  {
    "chip_name": "Singapore Chili Crab",
    "description": "Singapore Chili Crab: A fiery celebration on a plate, bursting with sweet crabmeat in a luscious, tangy chili sauce - the perfect burst of flavor for National Day! Dive into Singapore's iconic dish, where every bite is a jubilant reminder of this vibrant city-state.",
    "date": "2025-08-09",
    "image_url": "https://m.media-amazon.com/images/I/81mb65pzuSL._AC_.jpg"
  },
  {
    "chip_name": "Spicy Jalapeño",
    "description": "Today's Chip of the Day: Spicy Jalapeo! Sizzling with bold flavor, this chip is a fiery celebration on National CBD Day, adding a little kick to your munch and perhaps calming effects too for those looking for relaxation. Dive into crisp, crunchy perfection that's perfect for any spicy food lover's International Cat Day feast!",
    "date": "2025-08-08",
    "image_url": "https://www.thegoodcrispcompany.com/cdn/shop/files/bagofspicyjalapenocrinklecut.png?crop=center&height=1280&v=1742339773&width=820"
  },
  {
    "chip_name": "Mexican Street Corn Elote",
    "description": "Mexican Street Corn Elote: A fiery fiesta on a cob, this summer sensation features smoky grilled corn slathered in creamy cotija, zesty chili mayo, tangy lime, and crumbly cheese, topped with a confetti of fresh cilantro. Perfectly popping the perfect chip of zestful delight!",
    "date": "2025-08-07",
    "image_url": "https://i5.walmartimages.com/seo/2-Packs-Trader-Joe-s-Organic-Elote-Corn-Chip-Dippers-9-75-oz-Each_b39ca13c-d33f-46a7-8a77-5ca0396f55ee.4d8d36ab9f382aae99389800bc0e6f7d.jpeg"
  },
  {
    "chip_name": "Jalapeño",
    "description": "\"Today's spiciness level is off the charts! Feel the fiery thrill of authentic Mexican heat in every crunchy bite. Best paired with bold dipstoday's a celebration where your taste buds dance to the rhythm of jalapeo's vibrant flavor.\"",
    "date": "2025-08-06",
    "image_url": "https://m.media-amazon.com/images/I/71qtYELVsiL._AC_.jpg"
  },
  {
    "chip_name": "Wasabi & Rice",
    "description": "\"Wasabi & Rice is this week's Chip of the Day, a scrumptious fusion that combines fiery wasabi for a punch of flavor with comforting rice for balance. Perfectly embodies August's spiritspicy like those hot summer days, yet cool and soothing like a refreshing breeze.\"",
    "date": "2025-08-05",
    "image_url": "https://www.instacart.com/image-server/1200x1200/www.instacart.com/assets/domains/product-image/file/large_1400fda4-9990-484a-b065-677c33c69e11.JPG"
  },
  {
    "chip_name": "Wasabi & Soy",
    "description": "\"Wasabi & Soy is tonight's Chip of the Day, blending fiery excitement with a touch of sweet sophistication - the perfect fusion for those seeking adventure on National White Wine Day! Dive into bold flavors that dance on your taste buds.\"",
    "date": "2025-08-04",
    "image_url": "https://dr9wvh6oz7mzp.cloudfront.net/i/b537d541e1d9b82a12319f32b36ffda7_ra,w380,h380_pa,w380,h380.jpg"
  },
  {
    "chip_name": "Teriyaki Nori",
    "description": "Teriyaki Nori is today's Chip of the Day! It's a scrumptious twist on classic nori, infused with sweet teriyaki flavor - perfect for a fun snack while celebrating National Day or any wacky holiday this month. Dive into its umami-rich crunch for a delightful bite that packs a punch of taste!",
    "date": "2025-08-03",
    "image_url": "https://ecsmedia.pl/c/sen-soy-chipsy-nori-chips-o-smaku-teriyaki-4-5g-b-iext129468044.jpg"
  },
  {
    "chip_name": "BBQ Pulled Pork",
    "description": "Today's Chip of the Day: BBQ Pulled Pork! A smoky delight that melts in your mouth, bringing sizzling summer flavors to every bite. Perfectly paired with sunny August vibes and historical tales from centuries past, this dish is a savory connection through time and tradition.",
    "date": "2025-08-02",
    "image_url": "https://www.ubuy.com.ph/productimg/?image=aHR0cHM6Ly9pNS53YWxtYXJ0aW1hZ2VzLmNvbS9zZW8vTGF5LXMtQmFyYmVxdWUtRmxhdm9yZWQtUG90YXRvLUNoaXBzLTItNS1vei1CYWdfMWJhOTU2MTEtMzJlMi00MTMyLWI4NDctZjg0NzljMGQ4NmU1Ljc1ZjcwNzY0M2Q2Yjk5MmU4Mjk2ODMwOTUyODY4ZTYxLmpwZWc.jpg"
  },
  {
    "chip_name": "Alpine Herbs",
    "description": "Celebrate National Day with Alpine Herbs - a delightful fusion of Swiss flavors! Savor the essence of mountain freshness in every blend, perfect for culinary adventures near or far.",
    "date": "2025-08-01",
    "image_url": "https://image.migros.ch/mo-boxed/v-w-1000-h-1000/1bf7e2672b62963f196088770c76daac803d769d/migros-bio-chips-erbe-alpine.jpg"
  },
  {
    "chip_name": "Golden Frites Crisp",
    "description": "Golden Frites Crisp: Celebrate National Day with a delightfully crispy twist on Belgian flavors! Today, savor chips that ooze with the authentic taste of moules-frites - savory mussels paired perfectly with fries, in every bite as crunchy as today's festivities.",
    "date": "2025-07-21",
    "image_url": "https://i5.walmartimages.com/seo/Golden-Flake-Original-Dip-Style-Potato-Chips-Gluten-Free-Sharing-Size-8-oz-Bag_87adb4ee-4d98-4842-ae17-7dbb4d00ec9b.5b09d91c76a49dac79e2d3d29fc87744.jpeg"
  },
  {
    "chip_name": "Herbes de Provence",
    "description": "Celebrate Bastille Day with Herbes de Provence, the vibrant essence of France! Elevate your culinary experience with this blend, perfect for a Nioise salad or brioche, bringing sunny Provencal flav...",
    "date": "2025-07-14",
    "image_url": "https://fridg-front.s3.amazonaws.com/media/CACHE/images/products/chips-classiques-aux-herbes-de-provence-vico-125g/9a3828866eac240aeba7795b9b032028.jpg"
  },
  {
    "chip_name": "Independence BBQ",
    "description": "Celebrate freedom with our Independence BBQ-flavored chips - bold flavors inspired by America's classic cuisine, perfect for your 4th of July celebration!",
    "date": "2025-07-04",
    "image_url": "https://cdn.gardengrocer.com/attachments/photos/high_res/4315.jpg?4175"
  },
  {
    "chip_name": "Poutine Crunch",
    "description": "Celebrate Canada Day with a crispy bite of Poutine Crunch! This addictive chip is topped with savory cheese curds & tender gravy for a taste of our nation's beloved treat in every crunch. Happy Canada Day!",
    "date": "2025-07-01",
    "image_url": "https://caffeinecam.com/cdn/shop/files/DutchCrunchSpicyKetchupfront1.jpg?v=1709669428"
  },
  {
    "chip_name": "Filipino Adobo",
    "description": "Celebrate Philippine Independence Day with a zesty twist on our Chip of the Day: crispy Adobo-flavored potato chips, brimming with tangy garlic & soy, perfect for commemorating freedom and Filipino culinary pride!",
    "date": "2025-06-12",
    "image_url": "https://preview.redd.it/presidents-choice-filipino-adobo-v0-zyicw9r6dgxa1.jpg?width=1080&crop=smart&auto=webp&s=4c8fb831c46151b61247a52f55df5d50284f25fd"
  },
  {
    "chip_name": "Swedish Meatball",
    "description": "Savor a taste of Swedish pride with our Chip of the Day: a delightful fusion of tender meatballs blanketed in creamy sauce, served on a crispy roll - a playful tribute to National Day! Dive into this culinary tradition with each crunchy bite.",
    "date": "2025-06-06",
    "image_url": "https://www.foodbanjo.com/wp-content/uploads/2022/12/air-fryer-frozen-swedish-meatballs-2115-02.jpg"
  },
  {
    "chip_name": "Wasabi & Nori",
    "description": "Celebrate Constitution Day with a twist! Our Wasabi & Nori chips are a bold nod to Norway's culinary spiritcrisp flavors of sea meets fire, perfect for today's patriotic feast!",
    "date": "2025-05-17",
    "image_url": "https://www.animefanshop.de/images/product_images/original_images/c8e88cec796d9382a32c0e7b281262eb_Original-japanische-Premium-Kartoffelchips-Wasabi-Nori-von-KOIKEYA.jpg"
  },
  {
    "chip_name": "Elote",
    "description": "Savor the spirit of Cinco de Mayo with our Elote Chip - a crispy delight smothered in sweet corn goodness, topped with tangy lime zest and a sprinkle of chili for a burst of authentic Mexican flavo...",
    "date": "2025-05-05",
    "image_url": "https://img.buzzfeed.com/buzzfeed-static/static/2022-10/12/22/asset/21965ffe2e3e/sub-buzz-4012-1665614851-7.jpg"
  },
  {
    "chip_name": "Kangaroo Jerky",
    "description": "Celebrate ANZAC Day with Kangaroo Jerky: a savory snack infused with flavors of the Outback, perfect for commemorating courage and sharing on this special day!",
    "date": "2025-04-25",
    "image_url": "https://www.jerky.com/cdn/shop/files/Jerkycom-RippedOpenBags_1_copy.png?v=1715135925&width=720"
  },
  {
    "chip_name": "Ginger Thai",
    "description": "Celebrate Songkran with Ginger Thai's fiery fusion chips! Experience the vibrant taste of Thailand's water festival in every crisp bite, today, April 13, 2025.",
    "date": "2025-04-13",
    "image_url": "https://m.media-amazon.com/images/I/71-N14Ly52L._SL1500_.jpg"
  },
  {
    "chip_name": "Chilli Lime Potato Chips",
    "description": "Celebrate National Poutine Day with a twist! Our Chilli Lime Potato Chips are the cheeky addition to your classic poutine. Crispy, zesty, and bold, they're the playful pair that turns boring fries into party bites. Dive in for a flavor adventure worthy of this lively day!",
    "date": "2025-04-11"
  },
  {
    "chip_name": "Lemongrass & Coconut Crisps",
    "description": "\"April's sweetest surprise, Lemongrass & Coconut Crisps, dance on your tongue like a poetic breeze.Perfect for National Poetry Month, let these crispy companions inspire you as you savor the essence of creativity and delight in every bite.\"",
    "date": "2025-04-10"
  },
  {
    "chip_name": "Indian Mango Curry",
    "description": "\"Golden mango chunks dance in a spicy, tangy sauce, wrapped in crispy rice. A fiesta of flavors that'll make your taste buds samba all day long. Perfect for today's National IEP Writing Day and every occasion needing a flavor boost!\"",
    "date": "2025-04-07"
  },
  {
    "chip_name": "Tajín Spiced Lime",
    "description": "\"Zesty, citrusy crunch that dances on your tongue. Celebrate today's zestful flair with Tajn Spiced Lime chipsperfect for a fiesta in every bite!\"",
    "date": "2025-04-06"
  },
  {
    "chip_name": "Peanut Butter & Jelly",
    "description": "Crunch into creamy PB bliss, then smoosh in some jam delight. Celebrate National Peanut Butter and Jelly Day by pairing these chips with a dash of retro nostalgiaperfect for spreading smiles and satisfying crunchy dreams. Your taste buds are about to embark on a flavor journey straight out of the 70s lunchbox fantasy!",
    "date": "2025-04-02"
  },
  {
    "chip_name": "Mexican Chorizo & Paprika",
    "description": "\"Sizzling spice meets crispy crunch. Today, celebrate the fusion of chorizo's bold flavor and paprika's kiss, perfect for when your palate needs a fiesta!\"",
    "date": "2025-04-01"
  },
  {
    "chip_name": "Chickpea & Cardamom",
    "description": "National Take a Walk in the Park Day meets crunchy chickpea magic! Savor each step with these savory treats, as the cardamom whispers hints of exotic wonder amidst the fresh air. Perfect for pairing with your favorite dip or just strolling through the park's aroma of adventure. Today, let Chickpea & Cardamom be your guide to a flavor journey that complements every stride.",
    "date": "2025-03-30"
  },
  {
    "chip_name": "Lemon Herb & Olive Oil",
    "description": "Savor zesty tang and fragrant herbs in each bite. This is the chip that turns yoursnack into an Alexander Stewart-inspired adventure, perfect for today's magic of smoke and mirrors. Pair it with a cold one or dip in creamy goodness for an illusion of flavor explosion. March 29, meet your match!",
    "date": "2025-03-29"
  },
  {
    "chip_name": "Lemon & Herb Chickpea",
    "description": "Bursting with zesty freshness, these crunchy chickpeas dance with tangy lemon zest and a bouquet of herbs. A playful twist for International Women in Music Day, they're the perfect solo symphony or harmony to any melody. Elevate your playlist with a vibrant crunch that'll have everyone singing along.",
    "date": "2025-03-28"
  },
  {
    "chip_name": "Mexican Fiesta Mix",
    "description": "\"Today's crunch is fiery and festive! Mexican Fiesta Mix chips: zesty lime zest dances with smoky chipotle heat. Dive into a flavor fiesta, perfect for savoring on this World Theatre Day  let your taste buds direct the performance!\"",
    "date": "2025-03-27"
  },
  {
    "chip_name": "Wasabi & Lemon Cheddar",
    "description": "\"Rice meets zesty wasabi and tangy lemon zest, wrapped in creamy cheddar. Perfect for celebrating Maryland Day, it's a bold blend that invigorates your taste buds. Try it with a cold craft beer for a flavor explosion!\"",
    "date": "2025-03-25"
  },
  {
    "chip_name": "Mexican Fiesta Corn",
    "description": "National Cocktail Day & National Chocolate Covered Raisin Day: Savor the sweet and savory fusion of zesty lime zest and creamy chocolate drizzle. This Mexican Fiesta Corn bursts with flavor in every crisp bite, making it the perfect pairing for any cocktail or as a decadent snack on this dual celebration day!",
    "date": "2025-03-24"
  },
  {
    "chip_name": "Wasabi & Green Curry Leaf",
    "description": "\"Zingy wasabi meets tropical green curry leaf in this crunchy burst. Perfect for today's National Chip and Dip Day, pair it with a cool yogurt sauceit's like a jet of flavor landing on your palate!\"",
    "date": "2025-03-23"
  },
  {
    "chip_name": "Turmeric Cumin",
    "description": "Today's Chip of the Day celebrates Nowruz with a twist on traditional flavors: our Turmeric Cumin blend offers a sunny zest that's perfect for embracing spring's rejuvenation, inspired by the vibrant cuisine of Iran/Persia. Dive into its exotic taste, reminiscent of ancient spice routes and the colorful celebrations of Nowruz!",
    "date": "2025-03-21",
    "image_url": "https://farmspices.in/wp-content/uploads/2024/03/Bag_of_chips_v01-1-1200x960.png"
  },
  {
    "chip_name": "Thai Lemongrass & Cheddar",
    "description": "Savor the sunshine in each bite! Thai lemongrass dances with zesty cheddar in this vibrant rice crisp. The perfect blend for today's National Let's Laugh Daycrunch into smiles and tickle your taste buds like never before!",
    "date": "2025-03-19"
  },
  {
    "chip_name": "Mexican Hibiscus",
    "description": "Celebrate National Sloppy Joe Day with our zesty Mexican Hibiscus chips! A burst of floral hibiscus flavor, paired perfectly for a sloppy joe dip. It's like a fiesta in your mouth on this special day!",
    "date": "2025-03-18"
  },
  {
    "chip_name": "Sea Salt & Caper",
    "description": "Celebrate St. Patrick's Day with our Sea Salt & Caper Chip - a crisp crunch layered with zesty notes of caper, topped off with a sprinkle of sea salt for a uniquely Irish twist on delightfully salt...",
    "date": "2025-03-17",
    "image_url": "https://i5.peapod.com/c/XI/XIT2L.png"
  },
  {
    "chip_name": "Chorizo & Cheese Potato Crisps",
    "description": "\"Today, as Atlanta Hawks clash with Orlando Magic, fuel up with our Chorizo & Cheese Potato Crisps. Juicy chorizo meets melty cheese in every crispy bite, perfect for a game-day snacking frenzy or a fiesta of flavors!\"",
    "date": "2025-03-16"
  },
  {
    "chip_name": "Wasabi & Avocado",
    "description": "\"Slice of heaven meets crunch in this wasabi-kissed avocado delight. A Kansas celebration in every bitespicy, creamy, and oh-so-satisfying.\"",
    "date": "2025-03-15"
  },
  {
    "chip_name": "Mexican Chorizo Chipotle",
    "description": "Celebrate Pi Day by slicing into our Mexican Chorizo Chipotle chipsspicy, smoky, and packed with flavor. Each crunch is a fiesta in your mouth, turning math class vibes into festive fun. Dive deep into culinary adventure, where every bite is a celebration of numbers and chilies!",
    "date": "2025-03-14"
  },
  {
    "chip_name": "Wasabi & Lemon Twist",
    "description": "\"Zesty wasabi meets tangy lemon in a crispy dance. Celebrate today's flair by pairing this dynamic duo with a cold sake  it's National Good Samaritan Day, after all!\"",
    "date": "2025-03-13"
  },
  {
    "chip_name": "Wasabi & Mango",
    "description": "\"Zingy wasabi meets tropical mango in this crunchy delight. National Plant a Flower Day just got spicy and sweet.\"",
    "date": "2025-03-12"
  },
  {
    "chip_name": "Brazilian Picanha",
    "description": "Savor the essence of Brazil in each crisp bite. Picanha's bold, zesty flavor and satisfying crunch make every moment a celebration. Pair it with a caipirinha for pure bliss. It's March 11th, let's samba our way through the day!",
    "date": "2025-03-11"
  },
  {
    "chip_name": "Wasabi & Lemon Thyme",
    "description": "\"Rice meets zesty wasabi, tangy lemon zest, and herbaceous thyme. A burst of flavor fit for a culinary celebrationbecause today's not just any day, it's National Rice Crisp Day!\"",
    "date": "2025-03-08"
  },
  {
    "chip_name": "Indian Chaat",
    "description": "Taste the thrill of India's street food magic! Spicy, tangy, and oh-so-crunchy. Pair it with a zesty yogurt dip for a flavor explosion that's as lively as National Sock Monkey Day itself. Dive into this sensory adventure!",
    "date": "2025-03-07"
  },
  {
    "chip_name": "Lemon & Herb Cheddar",
    "description": "Sour yet sweet, tangy yet savory; this chip's a citrus-y twist on classic cheddar delight. Perfectly paired for National Oreo Cookie Daycrunch into zesty goodness while savoring chocolate dreams!",
    "date": "2025-03-06"
  },
  {
    "chip_name": "Sumac & Lemon Zest",
    "description": "\"March 4 magic in every bite: zesty sumac meets tangy lemon zest. A burst of exotic flavors perfect for celebrating today's feast and tomorrow's promise.\"",
    "date": "2025-03-04"
  },
  {
    "chip_name": "Simplify Your Life Sesame Seed Chip",
    "description": "Today's snack is not just any chipit's your Simplify Your Life Sesame Seed Chip! With every crunch, you'll taste the elegance of sesame seeds and a hint of zesty garlic. Perfectly paired for when you're decluttering or pondering life's complexitiesthese chips are here to remind you that simplicity tastes good too!",
    "date": "2025-03-03"
  },
  {
    "chip_name": "Thai Lemongrass Crunch",
    "description": "\"Today's crunch packs a playful zing! Thai Lemongrass meets crispy perfection. Dive into its citrus-y dance and savor every bite. Perfect for a midday smile or an evening zest booster.\"",
    "date": "2025-03-02"
  },
  {
    "chip_name": "Korean BBQ",
    "description": "Celebrate South Korea's Independence Day with our new BBQ chips! Crispy, smoky, and bursting with authentic Korean flavors - it's a chip-tastic way to indulge in some spicy BBQ goodness right from your snack bowl.",
    "date": "2025-03-01",
    "image_url": "https://static.wixstatic.com/media/72d8f2_1ee1e8e564d84d7c9695e717c64fd1c5~mv2.jpg/v1/fill/w_980,h_1225,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/72d8f2_1ee1e8e564d84d7c9695e717c64fd1c5~mv2.jpg"
  },
  {
    "chip_name": "Thai Lemongrass & Coconut",
    "description": "Savor today's crunch with Thai lemongrass and coconutlike a tropical breeze in your mouth. A flavor dance of zest and creamy richness, perfect for National Public Sleeping Day. Pair it with a dreamy smoothie or just close your eyes and let the warmth whisk you away. Sweet dreams await!",
    "date": "2025-02-28"
  },
  {
    "chip_name": "Japanese Sakura Blossom",
    "description": "Sakura in crunch formlight, crispy, with a hint of floral sweetness. Celebrate today's fairy tales with a touch of Japan's cherry blossom magic. Perfect for pairing with sweet dips or as an enchanting snack on National Tell A Fairy Tale Day.",
    "date": "2025-02-26"
  },
  {
    "chip_name": "Saffron Sea Salt",
    "description": "Savor the fusion of saffron's exotic allure with sea salt's earthy depthToday's Chip of the Day takes you on a flavor journey through the vibrant tastes of Kuwait's culinary heritage! Celebrate National Day with every crisp, delightful crunch.",
    "date": "2025-02-25",
    "image_url": "https://i.pinimg.com/originals/2f/33/96/2f33962231e1d5d67dc6ea39e8e28e88.jpg"
  },
  {
    "chip_name": "Tajín Chips",
    "description": "National Tortilla Chip Day's highlight: Crunch into Tajn's spicy-salty delight, where lime zest and chilies dance on your tongue. Perfect for a fiesta of flavors or an everyday thrill!",
    "date": "2025-02-24"
  },
  {
    "chip_name": "Herbed Olive Oil",
    "description": "Bursting with herbaceous notes and a smooth, buttery crunch, today's Chip of the Day takes you on a culinary tour through spring gardens. Pair it with a glass of crisp white wine for an elegant twist on National Banana Bread Day or mix it up with tangy dips to celebrate National Play Tennis Day in style. Dive into flavor that dances with every bitetoday, let your taste buds join the world's festivities!",
    "date": "2025-02-23"
  },
  {
    "chip_name": "Chickpea & Rosemary",
    "description": "\"Vegan delight meets Italian romance! Crisp chickpeas tossed in rosemary essence. Pair with wine or ice creamtoday's flavor fusion celebrates every sip and scoop.\"",
    "date": "2025-02-18"
  },
  {
    "chip_name": "Thai Lemongrass & Sweet Potato",
    "description": "Savor the sunshine in every bite! Today's Chip of the Day is a zesty dance of Thai lemongrass and sweet potato. Crispy, savory, and bursting with flavorpair it with a cold craft beer for the ultimate February 17 celebration.",
    "date": "2025-02-17"
  },
  {
    "chip_name": "Chile Sea Salt",
    "description": "Sizzling sea salt meets fiery chiles in this crispy delight. Perfect for celebrating the spice of today's festivities or just the thrill of a flavor adventure that sends your taste buds dancing.",
    "date": "2025-02-16"
  },
  {
    "chip_name": "Lemon & Herb Thyme Chips",
    "description": "Valentine's Crunch: A zesty dance of lemon zest and herby thyme. Savor this crispy kiss, perfect for a love that bites back!",
    "date": "2025-02-14"
  },
  {
    "chip_name": "Wasabi & Lemon Zest",
    "description": "\"Today's crisp sensation: zesty wasabi meets tangy lemon zest. It's like a flavor fireworks display in your mouth, perfect for celebrating the explosion of creativity on World Radio Day.\"",
    "date": "2025-02-13"
  },
  {
    "chip_name": "Thai Lemongrass Sea Salt",
    "description": "\"Today, Lincoln's Birthday, savor history's crispiness with our Thai Lemongrass Sea Salt kettle chips. Crispy, zesty, and aromatic like the great statesman himself, these chips are a flavor revolution. Pair them with a bold dip, and let your taste buds journey through time.\"",
    "date": "2025-02-12"
  },
  {
    "chip_name": "Wasabi & Shiso",
    "description": "National Umbrella Day's crunchy delight: Wasabi & Shiso rice crisp. Open an umbrella against this flavorful storm  the zesty kick of wasabi, paired with delicate shiso leaf essence, creating a unique taste sensation that turns any drizzle of rain into a celebration. Perfectly packed for a picnic under the umbrella or just to add some flair to your daily lunch.",
    "date": "2025-02-10"
  },
  {
    "chip_name": "Pizza Passion Blend",
    "description": "\"Slice into crispy bliss, where mozzarella dreams meet savory tomato ecstasy. This Pizza Passion Blend is your perfect pizza party in a chip, celebrating National Pizza Day and every craving in between.\"",
    "date": "2025-02-09"
  },
  {
    "chip_name": "Mexican Fiesta Potato Chips",
    "description": "Celebrate National Iowa Day with our Mexican Fiesta Potato Chips! Crispy, zesty, and bursting with authentic flavors, these chips are a fiesta in your mouth. Pair them with a cold beer or creamy queso for the perfect taste of adventure. Let's make today a celebration of bold flavors and good times!",
    "date": "2025-02-08"
  },
  {
    "chip_name": "Tikka Masala",
    "description": "Today's Chip of the Day is a burst of vibrant flavors, inspired by New Zealands rich culinary heritage! Savor the delicate balance of tikka masala, fused with tangy kiwi notes for a unique taste adventure that'll have you craving more on Waitangi Day, February 6, 2025.",
    "date": "2025-02-06",
    "image_url": "https://caffeinecam.com/cdn/shop/files/Lays_Holiday_Table_Tikka_Masala_Chips_220g_front.jpg?v=1730918019"
  },
  {
    "chip_name": "Crispy Quinoa",
    "description": "National Weatherperson's Day meets crunchy comfort with our Crispy Quinoa chipscloudless skies in every bite. Savory, earthy notes dance on your taste buds as you marvel at the sky's beauty below. Perfectly paired with a cold drink or a warm hug, this chip is your sunny side up on any gloomy day!",
    "date": "2025-02-05"
  },
  {
    "chip_name": "Herb Garden Medley",
    "description": "\"Today's crunch brings a medley of fresh basil, dill, and thyme. Celebrate National Soup Day by savoring this herbaceous burst in every bite.\"",
    "date": "2025-02-04"
  },
  {
    "chip_name": "Yuzu",
    "description": "Yuzu takes center stage as our Chip of the Day on Setsubun, celebrating Japan's vibrant flavors with its zesty, citrusy zest, perfect for a culinary journey through the Land of the Rising Sun.",
    "date": "2025-02-03",
    "image_url": "https://www.tokyo-smart.com/7608-large_default/potato-chips-yuzu.jpg"
  },
  {
    "chip_name": "Herbs de Provence Chips",
    "description": "Celebrate World Play Your Ukulele Day with a melody of flavors! Savor our Herbs de Provence Chipscrispy, herby, and as lively as your favorite tune. Pair them with a creamy dip for a rhythm that tickles the taste buds. Bon apptit and strum on!",
    "date": "2025-02-02"
  },
  {
    "chip_name": "Wasabi & Sea Salt",
    "description": "\"Wasabi meets sea salt in a fiery embrace, perfect for keeping safety top of mind this National Bath Safety Month. Crunch into zesty freshness, ensuring your bath time is anything but dull.\"",
    "date": "2025-01-30"
  },
  {
    "chip_name": "Chorizo & Cheese Chipotle",
    "description": "\"Spicy chorizo meets melty cheese in this bold crunch. Perfect for National Puzzle Day  challenge your mind while savoring each chip's smoky, savory sensation. Best paired with a cold brew for the ultimate brain fuel.\"",
    "date": "2025-01-29"
  },
  {
    "chip_name": "Chilli Sea Salt",
    "description": "\"Today's fiery flavor sensation! Chilli Sea Salt chips are the perfect spicy kick to your International LEGO Day fun. Crunch into bold heat and oceanic delight, paired with creamy dips for a feast fit for the gods.\"",
    "date": "2025-01-28"
  },
  {
    "chip_name": "Quinoa Crunch",
    "description": "Today, on Australia Day 2025, let's savor Quinoa Crunch  a zesty amalgamation of roasted quinoa with smoky charred flavors, inspired by Aussie barbecues! Crisp, chewy, and packed with a taste that captures the essence of an Australian sunset.",
    "date": "2025-01-27",
    "image_url": "https://www.alosraonline.com/media/catalog/product/5/2/527153_0_F.jpg?auto=webp&format=pjpg&width=1000&height=1000"
  },
  {
    "chip_name": "Masala",
    "description": "Masala takes you on a vibrant culinary journey through the heart of India's Republic Day festivities, with every crisp bite bursting with authentic flavors from diverse regional cuisines - a deligh...",
    "date": "2025-01-26",
    "image_url": "https://i5.walmartimages.com/seo/Lay-s-India-s-Magic-Masala-Potato-Chips-52-Gm-1-8-Oz_d473c6a4-a5f4-4b70-a97c-8368706afde5.91907f6e9d4e957195036c8629255f7b.jpeg"
  },
  {
    "chip_name": "Sweet Potato Chipotle",
    "description": "Savor sweet dreams and smoky reality in every crunch. Sweet potato's gentle sweetness meets chipotles fiery whisper. It's National Fish Taco Daylet these chips elevate your coastal cravings to new heights, turning every bite into a fiesta of flavor!",
    "date": "2025-01-25"
  },
  {
    "chip_name": "Lemon & Herb Blend",
    "description": "\"Brighten your day with zesty lemon zest and aromatic herbs. This chip's tangy twist is perfect for Global Belly Laugh Daypair it with a cold one or dip in sour cream for a giggly snack.\"",
    "date": "2025-01-24"
  },
  {
    "chip_name": "Japanese Shiso Leaf",
    "description": "Elevate your snack game with today's flavor sensation - Japanese Shiso Leaf chips. A zesty blend of minty freshness and umami delight, each bite feels like a burst of springtime in your mouth. Perfect for celebrating any holiday or just because you deserve it! Pair with wasabi dip to fully embrace the culinary adventure.",
    "date": "2025-01-22"
  },
  {
    "chip_name": "Sweet & Spicy Tamarind",
    "description": "\"Savor the sun's warmth in every bite. Sweet tamarind whispers nostalgia, spicy notes ignite adventure. Pair with a frosty brew, celebrate winter's end, and let this chip be your guide to January's sweet-spicy journey.\"",
    "date": "2025-01-21"
  },
  {
    "chip_name": "Pomegranate Falafel Chips",
    "description": "Taste the exotic! Pomegranate's sweet burst meets falafel's spicy allure in each crispy bite. It's like a dance of flavors on your tongue. Pair it with a tangy yogurt sauce or sip a refreshing mint tea; today, every snack becomes an adventure. Celebrate January 20th by stepping into the bold world of Pomegranate Falafel Chipsbecause life is too short for boring chips!",
    "date": "2025-01-20"
  },
  {
    "chip_name": "Garden Vegetable",
    "description": "Today, let's celebrate community and equality with every crunch of our Garden Vegetable potato chips. Crispy, nutty, and oh-so-slightly zestyjust like the unity that binds us all on Martin Luther King Jr. Day. Pair with a classic dip for a taste that honors today's principles.",
    "date": "2025-01-19"
  },
  {
    "chip_name": "Wasabi & Tofu",
    "description": "\"Today, Wasabi & Tofu Rice Crisp is the perfect bite-sized tribute to National Gourmet Coffee Day. Crunch into a harmony of spicy wasabi and creamy tofu, each crisp exploding with umami flavors like a morning cup of espresso. A dash of sesame rounds it out for a snack that's as satisfying as your favorite latte.\"",
    "date": "2025-01-18"
  },
  {
    "chip_name": "Mexican Chorizo & Cheese",
    "description": "Spicy chorizo meets melty cheese in each crunchy bite. It's National Kid Inventors' Day; let your taste buds innovate too! Pair with a frosty beer for a culinary creation that celebrates creativity and flavor.",
    "date": "2025-01-17"
  },
  {
    "chip_name": "Chili Sea Salt",
    "description": "\"Bite into fiery oceans of flavor. Today, let Chili Sea Salt be your salty solace on National Nothing Daycrisp, crunchy, and a dash of adventure in every crunch.\"",
    "date": "2025-01-16"
  },
  {
    "chip_name": "Mexican Fiesta Chipotle",
    "description": "Celebrating National Bagel Day, our Mexican Fiesta Chipotle takes you on a spicy journey. Crispy and zesty, it's like a dance of fire and flavorperfect for dipping in your favorite queso or spreading some festive joy with every crunch!",
    "date": "2025-01-15"
  },
  {
    "chip_name": "Beetroot & Thyme",
    "description": "\"Today's crisp is a beet in disguisesweet earthiness meets fragrant thyme. Aromatic, like winter's breath on a frosty morning. Perfectly paired with creamy dips, celebrating January's chill with a hint of summer's magic.\"",
    "date": "2025-01-14"
  },
  {
    "chip_name": "Turmeric & Coconut",
    "description": "\"Golden-hued delight meets creamy coconut in this tropical twist. Perfect for National Rubber Ducky Dayfloat one in your dip and watch it swim!\"",
    "date": "2025-01-13"
  },
  {
    "chip_name": "Indian Spiced Curry Leaf",
    "description": "Curry up, it's National Curried Chicken Day! Dive into crispy Indian spiced flavorsbold, fragrant, and as lively as a dance number. Each crunch delivers a symphony of spices straight from the spice bazaars of India. Perfectly paired with creamy raita or spicy mango chutney, this chip is your ticket to a culinary adventure across continents. So here's to celebrating cultures and cravings on this very special day!",
    "date": "2025-01-12"
  },
  {
    "chip_name": "Spicy Turmeric Lime",
    "description": "\"Raid your spice cabinet, it's time to unleash some zest! These fiery chips dance with turmeric's warmth and lime's zing. Perfect for a January burst of flavor, they're like a mini vacation in every crunch.\"",
    "date": "2025-01-11"
  },
  {
    "chip_name": "Wasabi Lime",
    "description": "Lime zest meets wasabi blast in a chip that's zippy yet cool. Perfect for slurping oysters Rockefeller style!",
    "date": "2025-01-10"
  },
  {
    "chip_name": "Thai Lemongrass & Lime",
    "description": "Savor the tropics in every crunch! Thai Lemongrass & Lime chips bring sunshine to your snacking. Bright, zesty flavors dance on your tongue like a mid-winter getaway. Pair with creamy coconut curry or sip on a refreshing lime soda for the ultimate flavor adventure today, National Apricot Day!",
    "date": "2025-01-09"
  },
  {
    "chip_name": "Mexican Fiesta Lime",
    "description": "\"Jazzy citrus tang meets crunchy perfection. Celebrate unity and innovation with every bite of Mexican Fiesta Lime - it's like a fiesta in your mouth!\"",
    "date": "2025-01-08"
  },
  {
    "chip_name": "Tom Yum Lime Chips",
    "description": "Savor the bold balance of Tom Yum's spicy tang and lime zest in each crispy bite. Today, celebrate the fusion of Asian flavors and Western crunch  a perfect pairing for your favorite dips or simply as a zesty snack that tickles your adventurous taste buds on National Day Radio Station Programming Site Advertising Trademark Licensing Speaking & Appearances Press Watch Latest Videos New National Day Proclamations National Day Calendar in the Headlines Celebrate Every Day Tell Us How You Celebrate Recipes Classroom Listoric.com Celebrat.",
    "date": "2025-01-07"
  },
  {
    "chip_name": "Lemongrass & Lime Potato Crisps",
    "description": "\"Start your day with a zesty awakening! Lemongrass and lime in every crisp bite. Perfect for January's sunny resolutions or a tangy twist on the New Year's breakfast routine.\"",
    "date": "2025-01-06"
  },
  {
    "chip_name": "Cheddar & Chive",
    "description": "Celebrate National Whipped Cream Day with a creamy burst in every bite. Our Cheddar & Chive chips are like cloud-kissed hills of Ireland, pairing perfectly with your favorite dips. Crispy, zesty, and oh-so-satisfying, they're the perfect match for a sweet and savory St. Patrick's Day treat!",
    "date": "2025-01-05"
  },
  {
    "chip_name": "Lemongrass & Lime Chips",
    "description": "Savor zesty sunshine in every bite! Lemongrass & Lime Chips: the tropical breeze of flavor, perfect for today's World Hypnotism Day. Close your eyes, take a chip, and let the zippy zest hypnotize your senses.",
    "date": "2025-01-04"
  },
  {
    "chip_name": "Miso & Wasabi Crunch",
    "description": "\"Today, miso's savory depth meets wasabi's fiery kick in this crispy wonder. Celebrate National Fruitcake Toss Day with a twist - toss these crunchies for an unexpected flavor adventure!\"",
    "date": "2025-01-03"
  },
  {
    "chip_name": "Kale & Bacon Chips",
    "description": "Celebrate World Introvert Day in style with Kale & Bacon Chipscrunchy, savory bliss that's secretly healthy. Just like introverts, these chips are a little mysterious and packed with flavor. Dip them in a cozy mug of tea or coffee; they're the perfect solo companion for introspection and creativity.",
    "date": "2025-01-02"
  },
  {
    "chip_name": "Wasabi & Sesame",
    "description": "Celebrating a fresh start in 2025, our Wasabi & Sesame Chip is a zesty fusion of Eastern flavors, blending spicy kick with nutty richnessperfect for reviving your taste buds as we ring in the New Year globally!",
    "date": "2025-01-01",
    "image_url": "https://welovecrisps.com/cdn/shop/products/packaging-inessence_wasabi_1024.png?v=1660308831&width=1200"
  }
]